[
  {
    "id": "style_1_dinamis",
    "name": "1. POSE DINAMIS & AKSI",
    "accentColor": "#FF4500",
    "icon": "fas fa-bolt",
    "definition": [
      "Pose yang menangkap momen cepat, potensi energi, atau benturan fisik yang kuat.",
      "Memanfaatkan 'Garis Aksi' (Line of Action) yang dramatis (seperti S-curve atau C-curve) untuk mengarahkan aliran gerakan.",
      "Umum digunakan dalam komik, manga shonen, film aksi, dan ilustrasi pertarungan."
    ],
    "subpose": [
      {
        "name": "Line of Action (S-Curve)",
        "description": "Pose yang menggunakan satu garis melengkung untuk memandu arah tubuh, menciptakan gerakan yang alami dan mengalir.",
        "exampleAnime": "Full-body anime illustration, extreme low-angle perspective, shonen manga style. A charismatic hero leaping toward the camera, torso forming a dynamic S-curve, wielding a glowing sword. Intense, focused eyes and detailed dynamic fabric folds on the flowing cape and uniform. Dramatic backlighting, anime illustration, 4k.",
        "exampleRealistic": "Concept art, full body, high fidelity: A cyberpunk assassin mid-leap across rooftops. The body forms a dramatic S-curve. Emphasize light sources from neon signs reflecting off textured leather armor. Focus on the sharp silhouette against the futuristic skyline."
      },
      {
        "name": "Line of Action (C-Curve)",
        "description": "Pose yang menggunakan satu garis melengkung (kurva C) untuk menunjukkan gerakan membungkuk, menarik, atau menghindar.",
        "exampleAnime": "A dynamic anime illustration, mecha pilot style. A character is executing a fast dodge motion, the body forming a strong C-curve, leaning far back. The arm is extended forward, the other pulled back, showing incredible speed and tension. Use speed lines and dust effects to emphasize momentum, manga panel style, dynamic lighting, anime.",
        "exampleRealistic": "Concept art, motion blur, intensity: A martial artist pulling back from a heavy punch, their torso creating a tight C-curve for recoil. Focus on the kinetic energy and sweat flying off the face."
      },
      {
        "name": "Foreshortening Aksi",
        "description": "Pose dengan perspektif terdistorsi untuk membuat anggota tubuh di latar depan (foreground) terlihat lebih besar dan lebih dekat.",
        "exampleAnime": "Shonen anime battle scene, extreme close-up. A character's fist is foreshortened, massively enlarged and thrust directly at the viewer. The rest of the body is sharply receding. Use thick, angular lines, high-impact cel shading, and motion blur for maximum effect, anime, detailed background destruction.",
        "exampleRealistic": "Concept art, dramatic perspective, low angle: A soldier is pointing a large-caliber weapon, the barrel of which is extremely foreshortened and dominates the frame. Focus on metallic textures and the intense, focused expression on the face."
      },
      {
        "name": "Backflip Mid-air",
        "description": "Karakter berada di udara, melengkungkan punggung ke belakang dalam putaran penuh.",
        "exampleAnime": "Dynamic anime illustration, superhero style. A character is captured mid-backflip, their body a perfect inverted arch, facing the viewer with a confident smirk. Use digital painting style with sharp, clean outlines and vibrant primary colors, high-contrast lighting, anime.",
        "exampleRealistic": "Concept art, motion captured: A spy executing a perfect backflip over a laser grid, captured at the apex of the movement. Focus on the tension in the muscles and the blur of the surroundings."
      },
      {
        "name": "Running Stride (Dynamic)",
        "description": "Pose saat berlari dengan kecepatan penuh, dengan lengan dan kaki terayun jauh dari pusat gravitasi.",
        "exampleAnime": "Shonen anime illustration, high speed. A character running at maximum speed, one leg stretched forward, the other trailing behind, torso slightly leaning forward. Emphasize speed lines, wind effects, and determined expression, action anime style.",
        "exampleRealistic": "Concept art, realistic motion blur: An athlete sprinting across a finish line, captured mid-stride. Focus on the powerful leg muscles and the determined expression."
      },
      {
        "name": "Guarding Stance (High Tension)",
        "description": "Pose defensif dengan kaki terbuka lebar dan tangan diangkat, siap untuk menangkis atau menyerang.",
        "exampleAnime": "Manga panel illustration, black and white style. A warrior in a low, tight guarding stance, knees bent, arms crossed defensively in front of the face, ready for impact. Use heavy ink and dramatic cross-hatching for shadow, anime/manga.",
        "exampleRealistic": "Concept art, battle ready: A knight in full, heavy plate armor adopting a low, stable guarding stance with a large shield and sword. Focus on the weight and metallic texture of the armor."
      },
      {
        "name": "Charging Attack",
        "description": "Karakter berlari kencang, senjata diangkat di belakang, siap melepaskan serangan kuat.",
        "exampleAnime": "Full-body action anime illustration, extreme motion. A character charging aggressively, weapon (e.g., spear/sword) held high behind their head, body taut with stored energy. Include 'power aura' effects and heavy ground dust, dynamic lighting, anime.",
        "exampleRealistic": "Concept art, visceral intensity: A berserker charging through snow, large axe raised high, mouth open in a roar. Focus on the raw energy and movement of the charge."
      },
      {
        "name": "Falling/Spinning",
        "description": "Karakter jatuh atau berputar di udara, biasanya dengan anggota badan yang tidak terkoordinasi.",
        "exampleAnime": "Dramatic anime illustration, night scene. A character is falling rapidly, spinning uncontrollably, limbs flung outward. Use stars or city lights blurring around them to show rotation, high detail, anime.",
        "exampleRealistic": "Concept art, high velocity: A figure tumbling from a great height in the dark, body spinning wildly. Focus on the distortion of the clothes and hair due to wind resistance."
      },
      {
        "name": "Drawing Weapon (Quick Draw)",
        "description": "Pose saat dengan cepat mengeluarkan senjata dari sarungnya, menunjukkan kecepatan dan ketepatan.",
        "exampleAnime": "Cowboy Bebop style anime illustration. A gunslinger mid-quick-draw, hand grasping the hilt of a pistol, focused on the target. Use sharp outlines and minimal, impactful color palettes, anime.",
        "exampleRealistic": "Concept art, Western setting: A sheriff drawing a revolver from a hip holster, captured in the fraction of a second just as the weapon clears the leather. Focus on the intense concentration in the eyes."
      },
      {
        "name": "Counterattack Stance",
        "description": "Pose setelah menangkis serangan, tubuh memutar untuk meluncurkan serangan balasan.",
        "exampleAnime": "Manga action panel, close quarters combat. A fighter has just deflected a blow, their body twisted dramatically, using the momentum to swing their leg/arm for a counterattack. Use angular composition and flash effect lines, anime/manga style.",
        "exampleRealistic": "Concept art, martial arts: A figure absorbing a strike with one arm while simultaneously pivoting and launching a powerful elbow strike. Focus on the shift of body weight and balance."
      },
      {
        "name": "Aerial Kick",
        "description": "Pose di udara saat menendang, dengan satu kaki menopang dan kaki lainnya terentang penuh.",
        "exampleAnime": "Full-body anime illustration, fighting game style. A female martial artist executing a powerful aerial roundhouse kick. The striking leg is fully extended and foreshortened towards the viewer. Dynamic shading and glowing energy around the foot, shonen anime.",
        "exampleRealistic": "Concept art, dynamic sports: A taekwondo master executing a flying side kick, body perfectly horizontal in the air. Focus on the stretched lines of the leg and the impact of the movement."
      },
      {
        "name": "Crouching Stealth",
        "description": "Pose rendah dan membungkuk, siap untuk menyelinap atau melompat.",
        "exampleAnime": "Dark, moody anime illustration, ninja style. A character crouched low on one knee on a rooftop, silhouetted against the moon, ready to move stealthily. Use deep shadows and minimalist line art, anime/manga.",
        "exampleRealistic": "Concept art, espionage: A spy fully concealed in the shadows, crouched low with one hand extended to brace, waiting for the right moment. Focus on textures of tactical gear."
      },
      {
        "name": "Power Up (Kekuatan Penuh)",
        "description": "Pose berdiri tegak, memancarkan aura energi, seringkali dengan rambut atau pakaian yang terangkat.",
        "exampleAnime": "Epic shonen anime illustration, transformation scene. A character stands with legs apart, arms wide, head tilted back, enveloped in a crackling yellow-green energy aura. Use extreme detail in the energy effects and dynamic motion lines, anime, cel shading.",
        "exampleRealistic": "Concept art, sci-fi hero: A figure stands amidst a vortex of lightning, eyes glowing, arms spread wide as they channel immense energy. Focus on particle effects and dramatic volumetric light."
      },
      {
        "name": "Sliding Under Attack",
        "description": "Karakter meluncur di tanah untuk menghindari serangan di atas kepala.",
        "exampleAnime": "Dynamic anime illustration, low angle. A character is sliding rapidly on the ground, one hand bracing the body, the other holding a sword or gun low. Extreme motion blur and dust clouds are visible, action anime style, cel shading.",
        "exampleRealistic": "Concept art, action movie: A figure in tactical gear sliding across a wet factory floor, narrowly avoiding a massive falling obstacle. Focus on spray and surface reflections."
      },
      {
        "name": "High Jump (Gravitasi Rendah)",
        "description": "Karakter melompat vertikal tinggi dengan lutut ditarik ke dada.",
        "exampleAnime": "Manga panel illustration, vertical composition. A character is frozen at the peak of an impossible jump, knees tucked to the chest, looking down at the ground far below. Use heavy line work and speed lines for height, anime/manga.",
        "exampleRealistic": "Concept art, parkour master: A free-runner suspended mid-air between two buildings, knees drawn high, focused on the landing point. Focus on urban details and distance."
      },
      {
        "name": "Throwing Object (Kuat)",
        "description": "Pose saat melepaskan lemparan dengan seluruh kekuatan tubuh, torsi penuh.",
        "exampleAnime": "Shonen anime illustration. A character's body is fully twisted, arm extended violently forward, having just released a powerful projectile (e.g., throwing star or energy ball). Dynamic fabric snap and wind motion, high-impact anime.",
        "exampleRealistic": "Concept art, baseball pitcher: A figure at the moment of releasing a ball, full rotation of the torso and arm, focus on the tension in the shoulder and forearm muscles."
      },
      {
        "name": "Weapon Brandishing",
        "description": "Karakter memegang senjata (misalnya pedang) tinggi di udara, berteriak, mengumpulkan tekad.",
        "exampleAnime": "Epic fantasy anime illustration. A hero stands on a rocky outcrop, holding a massive, glowing sword above their head against a stormy sky, mouth open in a rallying cry. Use strong backlight and dramatic shadows, anime.",
        "exampleRealistic": "Concept art, medieval war: A general on horseback raising a banner and sword high before a charge. Focus on the raw emotion and leadership."
      },
      {
        "name": "Dodge/Pivot",
        "description": "Karakter menanam satu kaki dan memutar tubuh dengan cepat untuk menghindari serangan.",
        "exampleAnime": "Fast-paced anime battle scene. A character is pivoting sharply on the ball of one foot, the body leaning out of the line of fire. Motion lines spiral around the pivot point, showing rapid movement, cel shading, anime.",
        "exampleRealistic": "Concept art, boxing match: A boxer executing a sharp pivot, head dipping just under a hook. Focus on the speed and precision of the movement."
      },
      {
        "name": "Kneeling Ready Stance",
        "description": "Karakter berlutut di satu kaki, senjata disiapkan, siap melompat atau menembak.",
        "exampleAnime": "Sci-fi anime illustration, sniping pose. A character kneels low on one knee, holding a large, futuristic rifle steady, eye aiming down the scope. Intense focus on the face and weapon detail, anime.",
        "exampleRealistic": "Concept art, military sniper: A soldier kneeling in a rocky environment, taking aim with a camouflage rifle. Focus on the stability and environmental blend."
      },
      {
        "name": "Wall Run (Kontra-Gravitasi)",
        "description": "Karakter berlari secara horizontal di dinding.",
        "exampleAnime": "Dynamic ninja anime illustration. A character running horizontally up a vertical stone wall, body parallel to the ground, defying gravity. Use extreme vertical perspective and wind effects, anime.",
        "exampleRealistic": "Concept art, superhero training: A figure running across the side of a building. Focus on the unique angle and the friction of the shoes against the glass."
      },
      {
        "name": "Finishing Blow",
        "description": "Pose setelah pukulan atau tebasan terakhir, badan condong ke depan, senjata terkulai sesaat.",
        "exampleAnime": "Climactic anime scene. A hero stands with their back to the viewer, weapon lowered and smoking, post-final blow. Use intense cinematic lighting, dust slowly settling, anime.",
        "exampleRealistic": "Concept art, dark fantasy: A figure standing over a defeated enemy, bloodied sword dripping, posture showing exhaustion and finality."
      },
      {
        "name": "Covering Fire",
        "description": "Karakter bersembunyi di balik penutup, mencondongkan badan untuk menembak balik.",
        "exampleAnime": "Sci-fi tactical anime illustration. A character crouching behind a broken concrete barrier, leaning out with a focused expression to return fire with a laser pistol. Use stark shadows and muzzle flash effects, anime.",
        "exampleRealistic": "Concept art, urban warfare: A soldier crouched behind a burnt-out car door, rifle raised, peering through the scope. Focus on the dirty, metallic textures."
      },
      {
        "name": "Staggered (Tersandung)",
        "description": "Pose tidak seimbang, satu kaki tersandung, mencoba mendapatkan kembali stabilitas.",
        "exampleAnime": "Shonen anime illustration, injured scene. A character stumbling backward, one arm clutching a wound, trying desperately to regain balance, face grimacing in pain. Use sharp, jagged line art, anime.",
        "exampleRealistic": "Concept art, wilderness survival: A figure slipping on ice, arms flailing to catch balance, the ground rushing up. Focus on the immediate moment of instability."
      },
      {
        "name": "Flying/Gliding",
        "description": "Karakter melayang di udara dengan tangan dan kaki terentang, menunjukkan kontrol atau kecepatan.",
        "exampleAnime": "Fantasy anime illustration. A magical girl or boy gliding gracefully through the clouds, hands extended forward, hair and ribbons flowing behind them. Use soft gradients and beautiful sky lighting, anime.",
        "exampleRealistic": "Concept art, aerial suit: A pilot in a high-tech gliding suit soaring through a canyon. Focus on the aerodynamic shape and the wind resistance."
      },
      {
        "name": "The 'V' Stance",
        "description": "Pose pahlawan ikonik: berdiri tegak dengan kaki sedikit terpisah, satu tangan di pinggul, tangan lainnya memegang senjata.",
        "exampleAnime": "Classic superhero anime illustration. A strong character standing in the iconic 'V' stance, chest puffed out, one hand on their belt, the other holding a glowing artifact. Strong primary lighting and cel shading, anime.",
        "exampleRealistic": "Concept art, comic book hero: A figure striking a powerful, confident pose on a hilltop, cape billowing dramatically behind them. Focus on the heroic silhouette."
      }
    ]
  },
  {
    "id": "style_2_emosi",
    "name": "2. POSE EMOSIONAL & DRAMATIS",
    "accentColor": "#00FA9A",
    "icon": "fas fa-heart",
    "definition": [
      "Pose yang dirancang untuk menyampaikan keadaan mental atau perasaan yang kuat, seringkali dengan isyarat tangan dan ekspresi wajah yang berlebihan.",
      "Mengutamakan komunikasi non-verbal dan koneksi emosional dengan penonton.",
      "Fokus pada wajah, tangan, dan postur tubuh secara keseluruhan untuk menyampaikan cerita."
    ],
    "subpose": [
      {
        "name": "Putus Asa (Despair)",
        "description": "Karakter berlutut dengan kepala tertunduk dalam, punggung membulat, menutupi sebagian wajah dengan tangan.",
        "exampleAnime": "Anime/manga illustration, monochrome shading. A character kneels on the ground in heavy rain, their head deeply bowed, and their body hunched over in overwhelming despair. Both arms are held tight against the head or covering the face. The scene is dark, moody, and highly emotional, focus on dramatic shadow work, anime, high-contrast.",
        "exampleRealistic": "Concept art, moody lighting, texture focus: A figure kneeling on broken concrete under a dim light, hunched over, conveying profound despair. Emphasize the texture of rough fabric and the shadow cast over the bowed head."
      },
      {
        "name": "Kekacauan (Chaos/Joy)",
        "description": "Karakter atau sekelompok karakter dengan gerakan melonjak, melompat, dan acak-acakan yang bersemangat.",
        "exampleAnime": "Shonen anime group illustration, high energy. A chaotic group of young characters jumping, shouting, and flailing their arms randomly and enthusiastically into the air. The scene is an explosion of uncoordinated, high-energy movement. Use vibrant colors, thick outline art, and sparkling effects to show chaotic joy, anime, screen capture quality.",
        "exampleRealistic": "Concept art, chaotic joy, explosion of energy: A group of figures jumping, shouting, and flailing their arms randomly and enthusiastically into the air. The scene is a mix of uncoordinated, high-energy movement. Focus on the sheer volume of excited gestures."
      },
      {
        "name": "Kagum (Admiration)",
        "description": "Satu karakter berlutut atau membungkuk di hadapan yang lain yang berdiri tegak.",
        "exampleAnime": "Epic anime illustration, cinematic view. A figure standing tall and centered, radiating power and light, while a supplicant kneels low on both knees before them, head bowed deeply in reverence. The extreme difference in vertical height emphasizes the hierarchy and awe. Use soft yet powerful lighting, detailed character design, anime.",
        "exampleRealistic": "Concept art, hierarchy, reverence: A supplicant kneels low on both knees and bows deeply before a figure standing tall and centered on a pedestal. The extreme contrast in verticality emphasizes the power and the act of submission."
      },
      {
        "name": "Kemenangan (Triumphant)",
        "description": "Karakter berdiri tegak dengan dada membusung, satu atau kedua tangan diangkat ke udara.",
        "exampleAnime": "Shonen anime illustration, high emotion. A hero standing atop a rubble pile, both arms raised high in a V-shape, head thrown back in triumphant laughter. Use dramatic lens flares, glowing effects, and heavy cel shading, anime.",
        "exampleRealistic": "Concept art, cinematic hero: A warrior standing silhouetted against a setting sun, arms raised in a victorious gesture, sword planted in the ground."
      },
      {
        "name": "Fokus Intens",
        "description": "Ekspresi wajah close-up dengan mata menyipit tajam, menunjukkan konsentrasi penuh atau kemarahan yang tertahan.",
        "exampleAnime": "Close-up anime portrait, dark atmosphere. Character's face in three-quarter view, eyes narrowed into sharp slits, deep focus, brow furrowed. Use heavy black outlines and minimal color, manga panel style, intense, anime.",
        "exampleRealistic": "Concept art, dramatic lighting: A close-up on a face illuminated only by the faint light of a monitor, showing intense, focused concentration. Emphasize wrinkles and skin texture."
      },
      {
        "name": "Terkejut/Ngeri",
        "description": "Mulut terbuka lebar dalam bentuk 'O' atau tangan diletakkan di atas mulut atau pipi.",
        "exampleAnime": "Detailed anime illustration, psychological horror style. A character's face frozen in shock, eyes wide, one hand covering the mouth. Use muted, cold colors and a slight nervous tremble effect, anime, high detail.",
        "exampleRealistic": "Concept art, reaction shot: A person recoiling in horror, hands flying up to cover their mouth, eyes wide open. Focus on the raw, sudden fear."
      },
      {
        "name": "Duka Mendalam",
        "description": "Karakter meringkuk di lantai atau di tempat tidur, memeluk diri sendiri atau bantal.",
        "exampleAnime": "Slice of life anime illustration, sad mood. A female character curled up tightly on a bed under a blanket, clutching a pillow to her chest, face hidden. Use soft, diffused light and a cool color palette, anime.",
        "exampleRealistic": "Concept art, intimate scene: A figure huddled on the floor in a fetal position, knees drawn up, conveying deep, private grief. Focus on the soft fabric folds."
      },
      {
        "name": "Kelelahan",
        "description": "Karakter bersandar pada benda (dinding, meja) dengan bahu merosot, leher terkulai.",
        "exampleAnime": "Post-battle anime scene, digital painting. A hero slumped against a broken wall, head resting heavily on the shoulder, utterly exhausted. Use dull colors, sweat marks, and heavy breathing lines, shonen anime.",
        "exampleRealistic": "Concept art, gritty texture: A soldier leaning against a rough concrete wall, completely spent, head hanging low. Emphasize dusty gear and fatigue."
      },
      {
        "name": "Konfrontasi",
        "description": "Karakter berdiri tegak, jari telunjuk terentang dan menunjuk ke arah karakter lain (penonton).",
        "exampleAnime": "Manga panel style, dramatic confrontation. A character stands defiantly, aggressively pointing a finger directly at the viewer/opponent, slight smirk on the face. Use speed lines and impactful shadow contrast, anime.",
        "exampleRealistic": "Concept art, political drama: A figure standing over a table, leaning in aggressively, finger pointed down emphatically at a document or person. Focus on sharp, decisive posture."
      },
      {
        "name": "Tekad Tenang",
        "description": "Karakter berdiri, satu tangan terkepal di samping, tatapan mata lurus ke depan, dagu sedikit terangkat.",
        "exampleAnime": "Detailed anime portrait, light novel illustration style. A character standing with their body relaxed but one fist clenched tightly at their side, showing quiet, unshakeable determination. The expression is calm but intense, clean line art, anime.",
        "exampleRealistic": "Concept art, stoic expression: A figure standing motionless in a strong breeze, eyes fixed on the horizon, one hand a tight, powerful fist. Focus on the texture of the wind-blown hair."
      },
      {
        "name": "Memohon",
        "description": "Karakter merangkai tangan di depan dada atau wajah dalam isyarat permohonan yang mendalam.",
        "exampleAnime": "Emotional anime scene, cinematic lighting. A character standing, hands clasped tightly together, eyes wide and glistening with tears, pleading for help or mercy. Use soft, wet highlight effects, anime.",
        "exampleRealistic": "Concept art, desperation: A person kneeling slightly, hands clasped tightly in front of their chest, eyes looking up imploringly. Focus on the strain in the arms and hands."
      },
      {
        "name": "Ketidakpercayaan",
        "description": "Karakter memiringkan kepala dengan alis terangkat dan mata menyipit.",
        "exampleAnime": "Anime portrait, close-up. Character tilting head sideways, one eyebrow arched high in disbelief or skepticism. Use sharp, detailed eyes and minimal shading, manga style.",
        "exampleRealistic": "Concept art, interrogation scene: A figure leaning back in a chair, tilting their head, eyes narrowed in complete disbelief at the speaker."
      },
      {
        "name": "Marah Terpendam",
        "description": "Kepala menunduk, mata mengintip dari bawah poni atau rambut, mulut mengatup rapat.",
        "exampleAnime": "Dark anime illustration, intense emotion. Character's head is deeply bowed, eyes hidden by shadow but a piercing glare is visible underneath the hair. The face is dark, the mouth is a tight line of contained fury. Heavy cross-hatching, manga style.",
        "exampleRealistic": "Concept art, cinematic villain: A figure standing in a shadow, the face obscured, but the tension in the jawline suggests immense, controlled anger."
      },
      {
        "name": "Terluka Parah",
        "description": "Karakter merosot di tanah, satu tangan memegang luka di perut atau dada.",
        "exampleAnime": "Dramatic shonen anime illustration. A hero collapses to one knee, clutching a bloody wound, struggling to stay conscious. Use vibrant red blood effects and dynamic but weakening body posture, anime.",
        "exampleRealistic": "Concept art, survival horror: A figure collapsing against a tree trunk, eyes closed in pain, clutching a severe laceration. Focus on the pain and exhaustion."
      },
      {
        "name": "Kegilaan/Tawa Liar",
        "description": "Kepala terlempar ke belakang, lengan terentang, tawa yang tidak terkontrol.",
        "exampleAnime": "Extreme villainous anime illustration. A character throws their head back, laughing wildly, eyes wide open and manic, arms spread in a dramatic, unrestrained gesture. Use highly angular, sharp lines, anime, psychological horror style.",
        "exampleRealistic": "Concept art, dramatic villain: A figure standing on a balcony, laughing hysterically into the wind, face contorted in madness. Focus on the uncontrolled energy."
      },
      {
        "name": "Mengancam (Tangan di Leher)",
        "description": "Karakter memegang leher mereka sendiri atau leher orang lain dalam isyarat ancaman yang sunyi.",
        "exampleAnime": "Dark fantasy anime illustration. A figure stands calmly, one hand gently gripping their own neck or the air, conveying a silent, powerful threat. Use cold, menacing lighting, anime.",
        "exampleRealistic": "Concept art, silent threat: A figure standing in front of another, slowly closing their hand into a fist near the target's throat. Focus on the tense stillness."
      },
      {
        "name": "Memeluk Diri Sendiri (Kenyamanan)",
        "description": "Karakter memeluk diri sendiri erat-erat, seringkali meringkuk, mencari kenyamanan.",
        "exampleAnime": "Soft, emotional anime illustration. A character sits quietly, hugging their knees to their chest, arms wrapped around their legs, face buried slightly. Warm, comforting light, anime.",
        "exampleRealistic": "Concept art, vulnerability: A person sitting alone in a large room, hugging themselves tightly for reassurance. Focus on the small, guarded posture."
      },
      {
        "name": "Menarik Rambut (Frustrasi)",
        "description": "Karakter memegang atau menarik rambut mereka dengan kedua tangan karena frustrasi atau stres.",
        "exampleAnime": "Manga illustration, high stress. A character is pulling at their hair with both hands, eyes wide with distress, shouting in silent frustration. Use jagged speech bubble lines (but no text), anime/manga.",
        "exampleRealistic": "Concept art, high pressure: A business person sitting at a desk late at night, hands running through their hair in a moment of extreme frustration. Focus on the disarray."
      },
      {
        "name": "Rasa Ingin Tahu",
        "description": "Karakter berjongkok atau membungkuk, mencondongkan telinga untuk mendengarkan, mata waspada.",
        "exampleAnime": "Slice of life anime illustration. A young girl squatting down, head tilted forward, one hand cupped behind her ear to hear a secret. Wide, curious eyes, bright colors, anime.",
        "exampleRealistic": "Concept art, hidden detail: A figure bending low near a strange object, head cocked, listening intently to a faint sound. Focus on the slight tension in the neck."
      },
      {
        "name": "Kekalahan",
        "description": "Karakter berbaring telentang atau tengkurap di tanah, tanpa daya.",
        "exampleAnime": "Dramatic post-battle anime scene. A hero lies sprawled facedown on the cracked earth, one hand weakly reaching out, denoting absolute defeat. Dust and smoke linger around the body, dark cel shading, anime.",
        "exampleRealistic": "Concept art, exhausted end: A figure lying on their back in the rain, looking up at the sky, utterly defeated and motionless. Focus on the wet fabric sticking to the body."
      },
      {
        "name": "Gestur 'Come Here' (Jari)",
        "description": "Karakter menggerakkan jari telunjuk untuk memanggil seseorang, seringkali dengan ekspresi sombong.",
        "exampleAnime": "Anime illustration, high confidence. A character standing with one hand raised, slowly curling a finger in a 'come here' gesture, a confident, slightly arrogant smirk on the face. Sharp, focused lighting, anime.",
        "exampleRealistic": "Concept art, confident leader: A person standing in a doorway, beckoning subtly with one hand and a confident, challenging look."
      },
      {
        "name": "Menangis Histeris",
        "description": "Tangan di wajah, bahu bergetar, menangis dengan air mata yang deras.",
        "exampleAnime": "High-emotion anime illustration, close-up. Character covers their entire face with both hands, shoulders visibly shaking with sobs. Large, dramatic tears flowing down the cheek, highly detailed, anime.",
        "exampleRealistic": "Concept art, raw emotion: A person sitting, face buried in their hands, shoulders visibly shaking with uncontrolled sobs. Focus on the raw texture of tears and skin."
      },
      {
        "name": "Nostalgia (Tangan di Dada)",
        "description": "Karakter memejamkan mata, satu tangan diletakkan di atas dada atau hati.",
        "exampleAnime": "Melancholic anime illustration, sunset scene. A character stands with eyes gently closed, one hand resting over their heart, recalling a fond memory. Soft, warm gradient lighting, anime.",
        "exampleRealistic": "Concept art, peaceful reflection: A figure standing on a beach at sunset, eyes closed, one hand pressed to their chest. Focus on the golden hour light."
      },
      {
        "name": "Sombong (Tangan di Pinggul)",
        "description": "Karakter berdiri tegak, satu tangan di pinggul, dagu terangkat, tatapan meremehkan.",
        "exampleAnime": "Tsundere anime illustration. A female character stands with a defiant stance, hands on her hips, head held high, looking down her nose with a challenging glare. Sharp outlines and bright colors, anime.",
        "exampleRealistic": "Concept art, high fashion model: A figure striking a proud, arrogant pose on a runway, hands on hips, chin raised high. Focus on sharp angles and shadows."
      },
      {
        "name": "Tertawa Diam-diam",
        "description": "Karakter menutupi mulut dengan satu tangan saat tertawa kecil atau geli.",
        "exampleAnime": "Slice of life anime illustration. A character is covering their mouth with one hand to stifle a small, private laugh. Eyes are crinkled at the corners in amusement. Soft, gentle lighting, anime.",
        "exampleRealistic": "Concept art, casual moment: A person looking away and covering their mouth with their hand to hide a polite chuckle. Focus on the subtlety of the expression."
      }
    ]
  },
  {
    "id": "style_3_tenang",
    "name": "3. POSE TENANG & KEHIDUPAN SEHARI-HARI (SLICE OF LIFE)",
    "accentColor": "#4169E1",
    "icon": "fas fa-couch",
    "definition": [
      "Pose yang sederhana, realistis, dan santai, cocok untuk karakter yang sedang beristirahat atau melakukan aktivitas non-aksi.",
      "Garis aksi seringkali vertikal atau datar, menunjukkan stabilitas dan ketenangan.",
      "Fokus pada pakaian kasual, ekspresi wajah yang lembut, dan suasana yang damai."
    ],
    "subpose": [
      {
        "name": "Idle Stance (Santai)",
        "description": "Karakter berdiri santai dengan berat badan di salah satu kaki (kontrapposto), satu tangan di pinggul atau di saku.",
        "exampleAnime": "Slice of life anime illustration, gentle pastel colors, character design sheet quality. A female character standing in a casual idle stance, resting her weight on one leg (contrapposto). One hand is lightly placed on her hip, the other is holding a coffee cup. Soft light from the window, simple modern background, anime, clean line art.",
        "exampleRealistic": "Concept art, natural lighting, casual setting: A young woman standing in a relaxed pose in a busy cafe, with weight shifted to her left leg and one hand tucked into her jeans pocket. Focus on the realistic folds of her oversized sweater."
      },
      {
        "name": "Reading (Membaca)",
        "description": "Karakter duduk dengan nyaman, mata fokus pada buku, seringkali dengan kaki terlipat atau bersilang.",
        "exampleAnime": "Cozy slice of life anime illustration, warm indoor lighting, Ghibli style. A character is curled up comfortably on a window seat, deep in thought while reading a thick book. Their legs are tucked up, and one hand is gently supporting their chin. Detailed interior background with bookshelf and houseplants, soft focus, anime.",
        "exampleRealistic": "Concept art, soft focus, high detail: A figure sitting in a vintage armchair by a roaring fireplace, engrossed in a novel. The scene is lit only by the fire and a nearby table lamp, highlighting the peaceful mood."
      },
      {
        "name": "Thinking (Berpikir)",
        "description": "Karakter berdiri atau duduk tegak, satu tangan di dagu atau menopang kepala, tatapan mata fokus ke kejauhan.",
        "exampleAnime": "Detailed anime illustration, academic setting. A male character sitting at a desk late at night, leaning forward with his elbow resting on the table, and his fist lightly supporting his chin in deep concentration. A single beam of lamplight illuminates his face, leaving the rest in shadow, intense gaze, detailed uniform, anime.",
        "exampleRealistic": "Concept art, pensive mood, sharp focus: A business person standing by a large skyscraper window, looking out over the city. One hand is pressed to their chin in a thoughtful gesture. Focus on the reflection of the city lights in the glass."
      },
      {
        "name": "Leaning on Wall (Bersandar)",
        "description": "Karakter bersandar ke dinding dengan satu bahu dan kaki disilangkan di pergelangan kaki.",
        "exampleAnime": "Slice of life anime illustration, high school setting. A bored student leaning casually against a school hallway wall, one shoulder touching the wall, legs crossed at the ankle. Gentle, even lighting, anime.",
        "exampleRealistic": "Concept art, urban scene: A figure leaning against a brick wall on a street corner, relaxed posture. Focus on the texture of the rough brick and the casual folds of the jacket."
      },
      {
        "name": "Sitting on Floor (Santai)",
        "description": "Karakter duduk di lantai dengan kaki terentang atau terlipat, punggung bersandar pada sofa atau dinding.",
        "exampleAnime": "Minimalist anime illustration, cozy apartment setting. A character sitting directly on the carpeted floor, legs crossed loosely, happily eating a bowl of ramen while watching TV. Warm, gentle lighting, anime.",
        "exampleRealistic": "Concept art, natural living space: A person sitting cross-legged on a wooden floor near a window, enjoying a cup of tea. Focus on the soft morning light."
      },
      {
        "name": "Stretching/Yawn",
        "description": "Karakter meregangkan lengan ke atas setelah bangun atau saat bosan.",
        "exampleAnime": "Morning slice of life anime illustration. A character stretching vigorously, both arms fully extended high above the head in a wide, sleepy yawn. Sunlight streaming through the bedroom window, soft focus, anime.",
        "exampleRealistic": "Concept art, morning routine: A figure standing next to a bed, stretching their arms above their head in a deep morning stretch. Focus on the relaxed muscles and the slight curve of the back."
      },
      {
        "name": "Drinking Tea/Coffee",
        "description": "Karakter memegang cangkir dengan kedua tangan, meniup uapnya atau menyesapnya perlahan.",
        "exampleAnime": "Warm, peaceful anime illustration, cafe setting. A female character sitting at a wooden table, holding a steaming cup of tea with both hands close to her face, a small, content smile. Soft bokeh background, anime, high detail.",
        "exampleRealistic": "Concept art, rustic charm: A person sitting on a patio bench, holding a mug of coffee close to their face. Focus on the steam rising and the texture of the ceramic cup."
      },
      {
        "name": "Looking Out Window",
        "description": "Karakter berdiri dekat jendela, melihat ke luar dengan pandangan jauh, seringkali dengan tangan di ambang jendela.",
        "exampleAnime": "Melancholic anime illustration, rainy day. A male character standing by a large window, looking out at the rain, one hand resting lightly on the glass pane. The reflection of the room is visible on the wet glass, soft colors, anime.",
        "exampleRealistic": "Concept art, futuristic city: A figure standing by a massive panoramic window in a high-rise, looking at the city below. Focus on the scale and the details of the cityscape."
      },
      {
        "name": "Texting on Phone",
        "description": "Karakter melihat ke bawah ke ponsel, biasanya dengan bahu sedikit membungkuk dan leher condong ke depan.",
        "exampleAnime": "Slice of life anime illustration, modern fashion. A teenage girl sitting on a park bench, completely engrossed in her smartphone, both hands holding the device, head slightly bowed. Bright outdoor lighting, anime.",
        "exampleRealistic": "Concept art, candid shot: A person walking down a crowded street, momentarily stopping to check their phone, posture slightly slumped. Focus on the light of the screen reflecting on the face."
      },
      {
        "name": "Walking Dog (Leisurely)",
        "description": "Pose karakter saat berjalan santai, tali anjing di tangan, ekspresi wajah damai.",
        "exampleAnime": "Ghibli style anime illustration, lush park setting. A young woman walking slowly and peacefully in a park, holding a dog leash loosely, enjoying the quiet morning. Use soft, watercolor-like shading, anime.",
        "exampleRealistic": "Concept art, sunny afternoon: A figure walking a golden retriever through a suburban park, relaxed and enjoying the sunlight. Focus on the natural movement of the clothes and the dog's fur."
      },
      {
        "name": "Cooking/Stirring",
        "description": "Karakter berdiri di depan kompor, sedikit membungkuk, mengaduk panci atau wajan.",
        "exampleAnime": "Slice of life anime illustration, cozy kitchen. A character leaning over a pot on the stove, stirring with a wooden spoon, focused on the cooking process. Warm light from the stove and window, anime.",
        "exampleRealistic": "Concept art, home kitchen: A chef standing at a stainless steel stove, tasting a spoonful of sauce from a simmering pot. Focus on the textures of the steam and the metal."
      },
      {
        "name": "Sleeping (Peaceful)",
        "description": "Karakter tidur nyenyak di tempat tidur, biasanya dengan satu tangan di bawah pipi atau bantal.",
        "exampleAnime": "Gentle anime illustration, intimate scene. A character sleeping peacefully in a soft bed, one hand tucked under their head, a serene expression. Use very soft, blurred lighting and warm tones, anime.",
        "exampleRealistic": "Concept art, quiet bedroom: A figure asleep in a comfortable bed, light filtering softly through the curtains. Focus on the relaxed lines of the body and the smooth texture of the sheets."
      },
      {
        "name": "Sitting at Desk (Working)",
        "description": "Karakter duduk di meja, fokus pada komputer atau buku, punggung tegak atau sedikit membungkuk.",
        "exampleAnime": "Detailed anime illustration, high-tech classroom setting. A student sitting upright at a desk, writing diligently in a notebook, focused expression. Use clean line art and balanced lighting, anime.",
        "exampleRealistic": "Concept art, minimal office: A figure seated at a clean wooden desk, typing on a laptop, illuminated by a single modern desk lamp. Focus on the clean lines and concentration."
      },
      {
        "name": "Hands in Pockets (Kasual)",
        "description": "Karakter berdiri dengan kedua tangan dimasukkan ke dalam saku celana atau jaket, menunjukkan sikap acuh tak acuh.",
        "exampleAnime": "Casual slice of life anime illustration. A male character standing outside a convenience store, both hands completely hidden in his hoodie pockets, head slightly downcast, relaxed stance. Anime, soft shading.",
        "exampleRealistic": "Concept art, street photography: A person standing casually on a busy sidewalk, hands in pockets, observing the crowd. Focus on the fabric folds of the casual wear."
      },
      {
        "name": "Tied Up Hair (Rutinitas)",
        "description": "Karakter mengangkat kedua tangan ke belakang kepala untuk mengikat rambut menjadi kuncir kuda.",
        "exampleAnime": "Slice of life anime illustration, indoor lighting. A female character standing in front of a mirror, both arms bent and raised, neatly gathering her hair into a ponytail. Focus on the detailed hair movement, anime.",
        "exampleRealistic": "Concept art, bathroom scene: A person leaning into a mirror, using both hands to quickly tie up wet hair. Focus on the wet look and the purposeful gesture."
      },
      {
        "name": "Listening to Music",
        "description": "Karakter berjalan atau duduk dengan mata tertutup, *earphone* terpasang, tenggelam dalam musik.",
        "exampleAnime": "Aesthetic anime illustration, city night. A character sitting alone on a park swing, eyes closed, large headphones covering their ears. Focus on the gentle glow of city lights and a serene expression, anime.",
        "exampleRealistic": "Concept art, intimate moment: A figure walking through a forest path, eyes closed, listening intently to music through headphones. Focus on the peaceful isolation."
      },
      {
        "name": "Bored/Tired Slump",
        "description": "Karakter duduk dengan bahu membungkuk, menopang kepala dengan satu tangan di atas meja.",
        "exampleAnime": "School life anime illustration, classroom. A student slumped over their desk during a lecture, chin resting heavily on one hand, eyes half-closed in boredom. Simple cel shading, anime.",
        "exampleRealistic": "Concept art, lecture hall: A figure sitting in a tiered lecture hall, completely slumped forward, head supported by their fist. Focus on the tired posture."
      },
      {
        "name": "Adjusting Glasses",
        "description": "Karakter menggunakan satu atau dua jari untuk mendorong kacamata kembali ke hidung.",
        "exampleAnime": "Intelligent character anime illustration. A male character pushing up their spectacles with a single, precise finger. Subtle lighting reflection on the lenses, focused gaze, anime.",
        "exampleRealistic": "Concept art, library setting: A person reading a newspaper, pausing to adjust their reading glasses with a subtle push of the index finger. Focus on the delicate movement."
      },
      {
        "name": "Petting Animal",
        "description": "Karakter berjongkok atau membungkuk, membelai hewan peliharaan (anjing atau kucing).",
        "exampleAnime": "Healing slice of life anime illustration. A character kneeling down, gently stroking the head of a small cat sitting on the grass. Soft, sunny lighting, Ghibli style anime.",
        "exampleRealistic": "Concept art, warm interaction: A figure bending down, gently petting a dog's head, showing affection and relaxation. Focus on the fur texture."
      },
      {
        "name": "Crossing Arms (Defensif/Dingin)",
        "description": "Karakter berdiri tegak dengan lengan disilangkan di dada, menunjukkan sikap tertutup.",
        "exampleAnime": "Manga illustration, serious moment. A character standing with arms tightly crossed over the chest, a cold, distant expression. Use sharp, vertical lines and minimal movement, anime/manga.",
        "exampleRealistic": "Concept art, formal meeting: A figure standing with arms rigidly crossed, conveying strong disagreement or a defensive stance. Focus on the tight posture."
      },
      {
        "name": "Looking Up (Takjub)",
        "description": "Karakter memiringkan kepala ke belakang untuk melihat lurus ke atas.",
        "exampleAnime": "Wonder-filled anime illustration, festival night. A character looking straight up with wide, amazed eyes at fireworks exploding overhead. Use vibrant colors and dynamic light flashes, anime.",
        "exampleRealistic": "Concept art, astronomy: A figure standing in a desert, head tilted back, gazing at the overwhelming night sky. Focus on the silhouette and the stars."
      },
      {
        "name": "Buttoning Shirt (Awal Hari)",
        "description": "Karakter sibuk mengancingkan kemeja mereka, gerakan tangan yang terfokus.",
        "exampleAnime": "Slice of life anime illustration, early morning. A character standing in front of a mirror, meticulously buttoning up a school uniform shirt. Soft, pale light, focus on the hands, anime.",
        "exampleRealistic": "Concept art, intimate preparation: A close-up on a person's hands as they carefully fasten a cufflink or a shirt button. Focus on the detail of the fabric."
      },
      {
        "name": "Writing/Drawing (Fokus)",
        "description": "Karakter duduk, membungkuk di atas kertas, fokus pada pena atau pensil di tangan.",
        "exampleAnime": "Manga artist anime illustration. A character is hunched over a drawing table, deeply focused on inking a manga panel, pen held tightly. Dramatic lighting from a desk lamp, manga style.",
        "exampleRealistic": "Concept art, studio setting: An artist seated at an easel, chin almost touching the canvas, concentrating intensely on a small brushstroke. Focus on the texture of paint."
      },
      {
        "name": "Kaki Diangkat (Santai)",
        "description": "Karakter duduk di sofa atau kursi, satu kaki diangkat dan disandarkan ke kaki lainnya.",
        "exampleAnime": "Cozy anime illustration, living room. A male character sitting comfortably on a deep sofa, one foot resting casually on the opposite knee, relaxed posture. Warm interior light, anime.",
        "exampleRealistic": "Concept art, modern apartment: A figure sitting on a minimalist chair, one knee crossed over the other in a relaxed but composed manner. Focus on the contrast of the pose and the clean environment."
      },
      {
        "name": "Tangan di Leher Belakang (Kaku)",
        "description": "Karakter menggaruk bagian belakang leher mereka, menunjukkan kecanggungan atau kebingungan.",
        "exampleAnime": "Awkward anime illustration. A character standing slightly hunched, one hand rubbing the back of their neck nervously, looking away with a blush. Simple cel shading, anime.",
        "exampleRealistic": "Concept art, uncomfortable situation: A person shifting their weight from foot to foot, one hand tentatively rubbing the back of their neck, avoiding eye contact. Focus on the body language."
      }
    ]
  },
  {
    "id": "style_4_interaksi",
    "name": "4. POSE INTERAKSI & KELOMPOK",
    "accentColor": "#DA70D6",
    "icon": "fas fa-users",
    "definition": [
      "Pose yang melibatkan dua karakter atau lebih, berfokus pada hubungan, komunikasi, dan dinamika kelompok.",
      "Mengutamakan garis pandang, kontak fisik, dan keseimbangan visual antar karakter.",
      "Digunakan untuk menunjukkan kemitraan, konflik, atau persahabatan."
    ],
    "subpose": [
      {
        "name": "Pasangan Berhadapan (Tegang)",
        "description": "Dua karakter berdiri berhadapan, tubuh sedikit miring, ekspresi intens.",
        "exampleAnime": "Dramatic anime illustration, shojo style. Two characters standing very close, staring intensely into each other's eyes, one hand reaching out hesitantly. Use soft lighting but strong shadows to convey tension, anime.",
        "exampleRealistic": "Concept art, romantic tension: Two figures standing close on a dimly lit street, their bodies slightly angled away, but their eyes locked intensely. Focus on the high contrast and mood."
      },
      {
        "name": "Partner Bahu-ke-Bahu",
        "description": "Dua karakter berdiri berdampingan, bahu bersentuhan, melihat ke arah yang sama, menunjukkan persatuan.",
        "exampleAnime": "Shonen group anime illustration. Two heroes standing side-by-side, backs to the viewer, one's elbow resting lightly on the other's shoulder, both gazing at a distant sunset. Strong sense of partnership and shared future, anime.",
        "exampleRealistic": "Concept art, squad photo: Two military figures standing shoulder-to-shoulder, looking directly ahead with matching, determined expressions. Focus on symmetrical gear."
      },
      {
        "name": "Pukulan Kepalan Tangan (Janji)",
        "description": "Dua karakter saling menyentuhkan tinju di depan mereka, menegaskan janji atau kesepakatan.",
        "exampleAnime": "Emotional anime illustration, close-up on hands. Two hands, one slightly injured, meeting in a tight fist bump over a glowing item. Use intense highlight on the knuckles, symbolizing a strong bond and determination, anime, cel shading.",
        "exampleRealistic": "Concept art, team bond: Two figures in uniform performing a dramatic fist bump, eyes locked in agreement. Focus on the intensity of the contact."
      },
      {
        "name": "Dukung dari Belakang",
        "description": "Satu karakter memeluk atau menopang karakter lain dari belakang, yang pertama terlihat sedih atau lelah.",
        "exampleAnime": "Healing slice of life anime illustration. A character is being gently hugged from behind by a supportive friend, chin resting on the shoulder. The foreground character's body is slumped in relief. Warm, comforting colors, anime.",
        "exampleRealistic": "Concept art, comfort scene: A figure standing with their back to the viewer, being held securely by another, head resting on the supporter's chest. Focus on the protective posture."
      },
      {
        "name": "Pertarungan Berpasangan (Sinergi)",
        "description": "Dua karakter bertarung berdampingan dalam gerakan terkoordinasi.",
        "exampleAnime": "Dynamic duo anime illustration. One character leaping over the second, who is crouched low, both attacking enemies in different directions in a perfectly synchronized move. Use extreme motion lines and complex foreshortening, shonen anime.",
        "exampleRealistic": "Concept art, fantasy combat: Two warriors, one wielding a sword high and the other a dagger low, attacking in a tight, coordinated formation. Focus on dynamic action and shadows."
      },
      {
        "name": "Memimpin dan Mengikuti",
        "description": "Satu karakter memegang tangan karakter lain dan menariknya ke depan, menunjukkan kepemimpinan.",
        "exampleAnime": "Shoujo anime illustration, running scene. A male character holds the hand of a female character, pulling her forward as they run through a crowded street, both smiling intensely. Focus on the flowing hair and excited expressions, anime.",
        "exampleRealistic": "Concept art, escape scene: A figure forcefully pulling another through a dense forest, their hands clasped tightly. Focus on the urgency and raw grip strength."
      },
      {
        "name": "Group Selfie/V-sign",
        "description": "Kelompok karakter berdesakan, membuat tanda V atau bersorak di depan kamera.",
        "exampleAnime": "School life anime illustration, bright and happy. A group of four high school students crammed together, making playful faces and V-signs at the camera (implied). Use vibrant, clean outlines and high-energy expressions, anime.",
        "exampleRealistic": "Concept art, travel snapshot: A group of friends huddled together in front of a famous landmark, all smiling and posing for a group picture. Focus on the casual, spontaneous moment."
      },
      {
        "name": "Berbagi Payung",
        "description": "Dua karakter berdiri sangat dekat di bawah satu payung di tengah hujan.",
        "exampleAnime": "Romantic slice of life anime illustration, rainy atmosphere. Two characters standing very close, one holding a shared umbrella, their shoulders touching. Soft lighting reflected from the wet pavement, anime.",
        "exampleRealistic": "Concept art, intimate shelter: Two figures huddled under a small umbrella in a heavy downpour, faces close, sharing the limited space. Focus on the texture of the rain and wet pavement."
      },
      {
        "name": "Menghibur (Tangan di Bahu)",
        "description": "Satu karakter meletakkan tangan yang meyakinkan di bahu karakter lain yang sedang sedih.",
        "exampleAnime": "Emotional anime scene. A character sits with a bowed head, and a second character stands, placing a gentle, comforting hand on their shoulder. Use soft, non-intrusive light, anime.",
        "exampleRealistic": "Concept art, supportive scene: A figure sitting on a park bench, being comforted by another figure standing and placing a hand firmly on their back or shoulder. Focus on the gesture of support."
      },
      {
        "name": "Ciuman Tangan",
        "description": "Satu karakter membungkuk dan mencium punggung tangan karakter lain dengan hormat.",
        "exampleAnime": "Shoujo romance anime illustration, fantasy setting. A handsome prince is bowing gracefully, kissing the back of a princess's hand. Focus on the delicate hand gesture and the strong emotional connection, anime.",
        "exampleRealistic": "Concept art, formal greeting: A figure in historical attire bowing deeply to kiss the back of a woman's hand. Focus on the elegant lines of the posture."
      },
      {
        "name": "Memiringkan Kepala Bersamaan",
        "description": "Dua karakter memiringkan kepala ke arah yang berlawanan atau bersamaan karena kebingungan.",
        "exampleAnime": "Comedic anime illustration, chibi style. Two characters standing side-by-side, both tilting their heads in perfect sync with a confused expression. Use bright, exaggerated facial features, anime.",
        "exampleRealistic": "Concept art, simultaneous reaction: Two figures looking at an absurd object, both simultaneously tilting their heads in puzzled synchronicity. Focus on the shared, subtle expression."
      },
      {
        "name": "Menyentuh Jari (Kontak Halus)",
        "description": "Dua karakter menyentuhkan ujung jari mereka, seringkali secara tidak sengaja atau ragu-ragu.",
        "exampleAnime": "Delicate shoujo anime illustration, close-up on hands. Two hands reaching towards each other, fingertips barely touching, conveying shyness or a nascent connection. Use soft, almost ethereal light, anime.",
        "exampleRealistic": "Concept art, moment of connection: The fingertips of two individuals lightly brushing against each other in a dimly lit space. Focus on the small, electric contact."
      },
      {
        "name": "Mengejek (Lidah Dijulurkan)",
        "description": "Satu karakter menjulurkan lidah pada karakter lain sambil menyilangkan mata.",
        "exampleAnime": "Comedic anime illustration, exaggerated expression. A character standing behind another, dramatically sticking out their tongue and making a silly face when the other isn't looking. Bright, playful colors, anime.",
        "exampleRealistic": "Concept art, childish antics: A figure playfully crossing their eyes and sticking out their tongue at a friend. Focus on the lighthearted mood."
      },
      {
        "name": "Pelukan Erat (Reuni)",
        "description": "Dua karakter saling berpelukan erat, menunjukkan kelegaan atau kasih sayang yang mendalam.",
        "exampleAnime": "Emotional reunion anime illustration. Two characters hugging tightly, one lift off the ground, faces partially hidden in the embrace, conveying immense relief and happiness. Use vibrant, warm colors, anime.",
        "exampleRealistic": "Concept art, powerful emotion: Two figures locked in a tight, desperate embrace after a long separation. Focus on the tension in the arms and the safety of the hug."
      },
      {
        "name": "Menarik Pipi",
        "description": "Satu karakter menarik pipi karakter lain dengan dua jari, biasanya karena gemas atau kesal.",
        "exampleAnime": "Comical slice of life anime illustration. A playful sister is gently but firmly pulling her brother's cheek, causing his face to stretch comically. Use exaggerated lines and a bright, familiar setting, anime.",
        "exampleRealistic": "Concept art, family moment: An older woman gently pinching the cheek of a younger relative with two fingers, a gesture of familiar affection. Focus on the slight distortion of the face."
      },
      {
        "name": "Membawa yang Terluka",
        "description": "Satu karakter menggendong atau menyeret karakter lain yang terluka atau pingsan.",
        "exampleAnime": "Grim action anime illustration. A strong hero is heavily supporting a severely injured companion, carrying their weight across a desolate battlefield. Use deep shadows and heavy, painful posture, anime.",
        "exampleRealistic": "Concept art, post-battle exhaustion: A soldier dragging an unconscious comrade over rugged terrain, their own body strained and exhausted. Focus on the weight and gravity."
      },
      {
        "name": "Saling Berbisik",
        "description": "Dua karakter berdekatan, satu membungkuk untuk membisikkan rahasia ke telinga yang lain.",
        "exampleAnime": "Intrigue anime illustration, dark classroom. Two characters leaning in close, one whispering conspiratorially into the other's ear. The other character's eye is widened in shock. Use sharp focus on the faces and whispered sound effects (implied), anime.",
        "exampleRealistic": "Concept art, hushed secret: Two figures leaning into each other over a crowded table, one whispering intensely, the other listening intently. Focus on the close proximity."
      },
      {
        "name": "Saling Menolong Bangun",
        "description": "Satu karakter berlutut dan mengulurkan tangan untuk membantu karakter lain berdiri.",
        "exampleAnime": "Hopeful shonen anime illustration. A hero is on one knee, offering a hand to their friend who is still on the ground, pulling them up into the light. Focus on the outstretched hands and the gesture of trust, anime.",
        "exampleRealistic": "Concept art, rescue scene: A figure extending a strong arm down into a dark pit to pull another person to safety. Focus on the grip and the upward pull."
      },
      {
        "name": "Melihat ke Langit Bersama",
        "description": "Dua atau lebih karakter berbaring di tanah, melihat ke langit atau bintang bersama.",
        "exampleAnime": "Peaceful slice of life anime illustration, summer night. Two friends lying side-by-side on a grassy hill, looking up at a beautiful, star-filled night sky. Use soft, ambient lighting and a serene mood, anime.",
        "exampleRealistic": "Concept art, camping night: A group of three people lying on sleeping bags, gazing up at the Milky Way. Focus on the vastness of the sky."
      },
      {
        "name": "Pagar Betis (Pertahanan Kelompok)",
        "description": "Kelompok karakter berbaris bahu-membahu, membentuk dinding pertahanan yang padat.",
        "exampleAnime": "Epic fantasy anime illustration. A tight line of armored warriors standing shoulder-to-shoulder, shields interlocked, bracing for an incoming attack. Use thick, heavy lines and sense of weight, anime.",
        "exampleRealistic": "Concept art, ancient battle: A phalanx of soldiers standing in an unyielding formation, spears pointed outward. Focus on the unified, rigid posture."
      },
      {
        "name": "Melindungi dengan Tubuh",
        "description": "Satu karakter membungkuk atau berlutut, melindungi karakter lain dengan tubuh mereka.",
        "exampleAnime": "Sacrificial anime illustration. A hero is crouched low, shielding a smaller, vulnerable person with their entire body from an explosion, back facing the danger. Use dramatic lighting and smoke effects, anime.",
        "exampleRealistic": "Concept art, protective instinct: A parent diving forward to cover their child from debris, arms wrapped tightly around the child. Focus on the urgent, protective curve of the back."
      },
      {
        "name": "Membawa di Punggung",
        "description": "Satu karakter membawa karakter lain di punggung (piggyback ride).",
        "exampleAnime": "Warm slice of life anime illustration. A cheerful male character giving a female character a piggyback ride, both smiling brightly. Use soft lighting and a lively, youthful atmosphere, anime.",
        "exampleRealistic": "Concept art, playful travel: A figure giving a friend a piggyback ride along a forest trail, both laughing. Focus on the balance and shared joy."
      },
      {
        "name": "Permainan Kejar-kejaran",
        "description": "Dua karakter berjarak dekat, satu mengejar yang lain dengan senyum main-main.",
        "exampleAnime": "Energetic school life anime illustration. A male student is chasing a female student playfully, both running with arms extended in a moment of shared, lighthearted fun. Dynamic background blur, anime.",
        "exampleRealistic": "Concept art, childhood memory: Two children running rapidly across a sunny field, one chasing the other with extended hands. Focus on the youthful freedom of movement."
      },
      {
        "name": "Tatap Mata Dalam",
        "description": "Dua karakter saling menatap mata dengan intens, tanpa kata-kata.",
        "exampleAnime": "Intimate shoujo anime illustration, close-up on faces. Two characters are staring deeply into each other's eyes, conveying unspoken emotion. Soft focus on the background, all attention on the intense gaze, anime.",
        "exampleRealistic": "Concept art, psychological scene: Two individuals sitting across a table from each other, engaged in a silent, intense staring contest. Focus on the unwavering eye contact."
      },
      {
        "name": "Saling Bersandar",
        "description": "Dua karakter duduk atau berdiri, bersandar ringan satu sama lain, menunjukkan keakraban santai.",
        "exampleAnime": "Relaxing slice of life anime illustration. Two friends sitting on a park bench, their heads leaning gently against each other, both reading or resting. Soft, gentle outdoor light, anime.",
        "exampleRealistic": "Concept art, close friendship: Two figures sitting on a train, one's head resting naturally against the other's shoulder while sleeping. Focus on the comfort and familiarity."
      }
    ]
  }
]

