[
  {
    "id": "style_1_dinamis",
    "name": "1. POSE DINAMIS & AKSI",
    "accentColor": "red",
    "icon": "fas fa-bolt",
    "definition": [
      "Pose yang menangkap momen cepat, potensi energi, atau benturan fisik yang kuat.",
      "Memanfaatkan 'Garis Aksi' (Line of Action) yang dramatis (seperti S-curve atau C-curve) untuk mengarahkan aliran gerakan.",
      "Umum digunakan dalam komik, manga shonen, film aksi, dan ilustrasi pertarungan."
    ],
    "subpose": [
      {
        "name": "Line of Action (S-Curve)",
        "description": "Pose yang menggunakan satu garis melengkung untuk memandu arah tubuh, menciptakan gerakan yang alami dan mengalir.",
        "exampleAnime": "A full-body anime illustration, extreme low-angle perspective (worm's eye view). A charismatic hero leaping toward the camera, torso forming a dynamic S-curve. The hero is wielding a glowing sword, with intense, focused eyes. Detailed dynamic fabric folds on the flowing cape and uniform. Dramatic backlighting from a central energy source, anime.",
        "exampleRealistic": "Concept art, full body, high fidelity: A cyberpunk assassin mid-leap across rooftops. The body forms a dramatic S-curve. Emphasize light sources from neon signs reflecting off textured leather armor. Focus on the sharp silhouette against the futuristic skyline.",
        "exampleAnatomy": "Black and white anatomical sketch. The simple line of action for a figure mid-stride, emphasizing the C-curve of the spine and the antagonistic tilt of the ribcage and pelvis. Focus on general body proportions, easy beginner prompt."
      },
      {
        "name": "Reaksi Benturan (Impact Reaction)",
        "description": "Momen setelah serangan mendarat, menunjukkan gelombang kejut dan energi yang menyebar.",
        "exampleAnime": "A gritty manga panel style. Close-up on a character being violently knocked backward by an unseen force. Hair and tattered clothing are whipped into the air, creating secondary motion lines. The pose shows maximal spine hyperextension and a look of pain/shock. Speed lines radiating outward from the point of impact, anime.",
        "exampleRealistic": "Concept art, medium shot, dramatic lighting: A warrior recoiling violently from a magical blast. The pose shows extreme backward arching. Illustrate debris and glowing particles originating from the impact point, casting sharp shadows on the contorted face. Focus on the raw energy transfer.",
        "exampleAnatomy": "Black and white anatomical sketch. A rigid figure recoiling, spine hyper-extended. Use sharp, angular lines to show the body being pushed backward. Highlight the tension in the neck, easy beginner prompt."
      },
      {
        "name": "Lompatan (The Leap)",
        "description": "Pose di tengah lompatan, menangkap puncak pendakian sebelum mendarat.",
        "exampleAnime": "An action anime shot from a slightly high angle (bird's eye view). A female ninja suspended perfectly mid-air, knees tucked close to her chest. She holds a short dagger in a reverse grip, poised for a descent. The lighting is harsh and dramatic, casting sharp shadows on the folded limbs, anime.",
        "exampleRealistic": "Concept art, cinematic wide shot, low angle: A stealth operative performing a gravity-defying jump over a laser grid. The figure is perfectly horizontal, viewed from below. The environment is dark and industrial, with focus on the metallic texture of the equipment and the intensity of the effort.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure suspended mid-air with knees tucked. Use simplified shapes for the torso. Exaggerate the bend in the knee and hip joints to show coiled power, easy beginner prompt."
      },
      {
        "name": "Berlari Kencang (Running at Full Speed)",
        "description": "Pose berlari dengan kecepatan tinggi, satu kaki di udara, seluruh tubuh condong ke depan.",
        "exampleAnime": "A realistic anime illustration of a marathon runner captured at the peak of their stride (all feet off the ground). The body is severely angled forward, showing maximum antagonistic movement in the arms and legs. Intense muscle definition is visible in the calves and thighs. Shallow depth of field focusing on the determined face, anime.",
        "exampleRealistic": "Concept art, dynamic angle, speed lines: A heavily armed soldier sprinting through a desolate, stormy landscape. The forward lean is aggressive. The foreground is blurred to show speed, focusing only on the determined face and the power in the legs. Render the rain streaks and wet ground textures.",
        "exampleAnatomy": "Black and white anatomical sketch. A full-figure sprinter with the body forming a strong diagonal. Use directional shading to emphasize major muscle groups (quadriceps and glutes) for power, easy beginner prompt."
      },
      {
        "name": "Maju Menyerbu (Charging Forward)",
        "description": "Pose saat bergerak cepat menuju lawan, seringkali dengan senjata diacungkan.",
        "exampleAnime": "A dramatic fantasy comic style. A heavily armored warrior, viewed from a close front-on perspective, charging with full momentum. The sword is raised high overhead in a two-handed grip. The front leg stomps down hard, kicking up dust and debris. Extreme determination on the face, anime.",
        "exampleRealistic": "Concept art, full body, dramatic perspective: An ancient Roman general charging forward during a battle, shield raised. Viewpoint is slightly behind and above, emphasizing the downward thrust of the charge. The lighting is harsh sunlight, reflecting off the metal shield and helmet. Focus on the weight and momentum.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a low, forward charge stance. Emphasize the long line of force from the back heel through the spine. Focus on the stability of the front leg, easy beginner prompt."
      },
      {
        "name": "Sikap Bertahan (Defensive Stance)",
        "description": "Sikap siaga yang dinamis, menunjukkan kewaspadaan dan potensi energi.",
        "exampleAnime": "A detailed anatomical drawing, focusing on muscle tension. A martial artist in a low, wide 'cat stance' with their weight centered, hands open and ready near the chest. The spine is perfectly vertical. Highlighted tension in the quadriceps and core muscles, showing energy coiled for an imminent move, anime.",
        "exampleRealistic": "Concept art, close focus, mystical: A sorceress in a wide, low defensive stance, surrounded by crackling arcane energy. The pose is rigid and centered. Illustrate the fine details of her robes resisting the outward force of the magic. Focus on stability and contained power.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a deep, balanced squat (horse stance). Use a grid overlay to show the symmetry and low center of gravity. Highlight the stable, vertical spine, easy beginner prompt."
      },
      {
        "name": "Tendangan Berputar (Spin Kick)",
        "description": "Momen kaki terentang penuh di udara saat tendangan berputar.",
        "exampleAnime": "A dynamic comic book cover art. A female fighter executing a powerful 180-degree roundhouse kick. The kicking leg is fully extended and horizontal. The supporting leg is pivot-toed. The body shows maximum rotational twist, with the opposing arm extended for counterbalance. Focus on the snap motion, anime.",
        "exampleRealistic": "Concept art, high detail, mid-action: A sleek cyborg performing a powerful, fully extended spin kick. The body shows extreme rotational twist. Render the metal/synthetic muscle textures and the sharp, aerodynamic lines of the extended leg. Energy trails follow the path of the foot.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure performing a roundhouse kick, showing maximal hip rotation and leg extension. Annotate the rotation axis of the spine and the counterbalance of the arms, easy beginner prompt."
      },
      {
        "name": "Berguling di Udara (Mid-Air Roll)",
        "description": "Pose berguling di udara untuk menghindari sesuatu atau bersiap mendarat.",
        "exampleAnime": "A character flipping in the air after falling from a height, with detailed motion lines indicating the speed of the rotation. Arms are tightly tucked to minimize air resistance, anime.",
        "exampleRealistic": "Concept art, action sequence, dynamic blur: A spy executing a tight defensive roll mid-air after an explosion. The figure is curled into a compact sphere. Use motion blur on the background but keep the character's core sharp. Focus on the protective, tucked position of the head and limbs.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a tight, curled-up C-curve roll. Use minimal lines, focusing on the spherical negative space and the protective tuck of the head and limbs, easy beginner prompt."
      },
      {
        "name": "Meningkatkan Kekuatan (Power Up Stance)",
        "description": "Pose sebelum melepaskan serangan energi, menunjukkan akumulasi kekuatan.",
        "exampleAnime": "A high-impact shonen manga style. A character standing with legs wide, facing forward, arms pulled back to the sides of the head. Intense visual energy (chi) is swirling violently around the hands and entire body. The expression is one of maximum strain and concentration. Symmetric composition, anime.",
        "exampleRealistic": "Concept art, epic scale, focused light: A protagonist gathering immense cosmic power. The pose is symmetrical and wide. Illustrate pure, bright energy (plasma) violently swirling outward from the clenched hands, illuminating the character from within. Focus on the strain lines on the face and clothing.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a wide, symmetrical stance with arms pulled back. Exaggerate the tension in the trapezius and latissimus dorsi. Use radiating lines to imply a central point of power, easy beginner prompt."
      },
      {
        "name": "Mendarat Keras (Landing Hard)",
        "description": "Momen setelah mendarat dari ketinggian, lutut ditekuk untuk menyerap benturan.",
        "exampleAnime": "A cinematic shot of a superhero landing on rough terrain. One fist is braced on the ground, the opposite knee is bent sharply to absorb impact, creating a dramatic, low silhouette. The background is a destroyed city, emphasizing the force of the landing. Dust and small stones fly up, anime.",
        "exampleRealistic": "Concept art, cinematic wide shot, dramatic dust: A heavily armored mech pilot executing a hard, three-point landing (one knee, one foot, one fist on ground). Dust and impact debris explode outward. Focus on the low silhouette and the feeling of weight crushing the ground.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure landing, showing severely bent knees and low center of gravity. Highlight the compressed joints and the shock absorption pathway, easy beginner prompt."
      },
      {
        "name": "Akhir Ayunan Pedang (Sword Swing Finish)",
        "description": "Akhir dari ayunan pedang, senjata ditarik menjauhi tubuh.",
        "exampleAnime": "A traditional Japanese ink wash (sumi-e) style. A lone warrior stands mid-stance after delivering a fatal blow. The sword is now held behind their back, extended away from the body, showing the end of the rotation. The posture is leaning slightly back, and the movement has just stopped, creating an aura of stillness, anime.",
        "exampleRealistic": "Concept art, atmospheric, stillness: A samurai standing motionless after a swift strike. The sword is held behind the back in the final rotation pose. Focus on the detailed textures of the flowing kimono and the vapor trail left by the blade. The scene should be silent and tense.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a maximum rotational twist (follow-through). Annotate the opposing rotation of the hips and shoulders. Show the release of tension in the legs, easy beginner prompt."
      },
      {
        "name": "Menarik Panah (Arrow Nocking)",
        "description": "Momen sebelum melepaskan panah, busur ditarik hingga ketegangan maksimum.",
        "exampleAnime": "A detailed fantasy illustration. A female elf archer at the 'full draw' position. The string hand is pulled back firmly to the corner of the mouth, the bow arm is straight and locked. The body leans back slightly, maximizing tension. Intense focus on the eye looking down the arrow shaft, anime.",
        "exampleRealistic": "Concept art, hyper-realistic fantasy: A tribal hunter at the full draw of a recurve bow made of bone and sinew. The body is taut and angled sideways. Focus on the strained textures of the bowstring digging into the fingers and the deep concentration in the eyes. Lighting should be from the side, emphasizing contours.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure at 'full draw.' Emphasize the straight line from the arrow tip to the elbow. Highlight the contraction of the major back muscles, easy beginner prompt."
      },
      {
        "name": "Jatuh Terlentang (Falling Backward)",
        "description": "Pose jatuh ke belakang (guling belakang) dengan satu tangan sebentar menopang momentum.",
        "exampleAnime": "A dynamic 3D render. A character mid-fall backward from a trip, the back arched and head slightly lifted to see the ground, hands instinctively reaching out for support. The pose shows the moment before hitting the ground. Low center of gravity, emphasis on the arched spine, anime.",
        "exampleRealistic": "Concept art, dramatic sequence, fast motion: A figure falling backward through a collapsing glass floor. The head is lifted in shock, and the arms are flailing for a grip. Use high-key lighting reflecting off the shattering glass fragments. Focus on the desperate, awkward body position.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure mid-fall, showing the awkward, uncontrolled splay of the limbs and the arching back. Use broken, angular lines to denote loss of control, easy beginner prompt."
      },
      {
        "name": "Meluncur Menghindar (Evasion Slide)",
        "description": "Pose meluncur di tanah atau lantai untuk menghindari serangan rendah.",
        "exampleAnime": "A neo-noir comic panel. A character sliding horizontally across a wet floor to evade a blast or obstacle. One arm is tucked in, the other is extended for support. The body is perfectly parallel to the ground. Viewpoint is level with the floor, emphasizing the speed, anime.",
        "exampleRealistic": "Concept art, neo-noir, cinematic: A spy sliding across a wet, metallic floor under a closing security door. The body is perfectly horizontal, with one arm extended for support. Focus on the reflected light on the wet surface and the blur of the movement.",
        "exampleAnatomy": "Black and white anatomical sketch. A horizontal figure sliding. Use a strong diagonal line to show the momentum. Highlight the tucked arm/head and the extended leg, easy beginner prompt."
      },
      {
        "name": "Berlari di Dinding (Wall Run)",
        "description": "Pose di mana kaki menekan dinding, tubuh condong secara horizontal.",
        "exampleAnime": "A high-speed photograph. A parkour athlete running horizontally up a concrete wall. The outer leg pushes strongly off the wall, while the body is angled perpendicular to the ground. The pose emphasizes the temporary, impossible nature of the balance, anime.",
        "exampleRealistic": "Concept art, high energy, wide angle: A rogue agent running horizontally along a sheer concrete wall in a narrow urban alley. The body is angled perpendicular to the ground. Emphasize the rough, gritty textures of the wall and the spray of dust from the pushing foot.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a gravity-defying wall run. Show the temporary angle of the body (90 degrees to the ground). Detail the extreme tension in the sole of the pushing foot, easy beginner prompt."
      },
      {
        "name": "Mengelak (Dodge and Weave)",
        "description": "Pose tinju merunduk ke samping untuk menghindari pukulan lawan.",
        "exampleAnime": "A black and white photograph of a boxing match. A fighter executing a deep 'bob and weave' movement, the torso curved into a sharp C-shape to let the opponent's punch fly over their shoulder. The legs are stable and wide. Focus on the strong neck muscles allowing the rapid movement, anime.",
        "exampleRealistic": "Concept art, comic book, high tension: A street fighter executing a low, C-curve dodge, narrowly avoiding a massive incoming punch. The opponent's fist should be blurred in the foreground. Focus on the sharp, rapid curve of the torso and the stable, grounded legs.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a deep bob and weave. Use a sharp, exaggerated C-curve for the spine. Highlight the strong, contracting oblique muscles on the side of the bend, easy beginner prompt."
      },
      {
        "name": "Menarik Ketegangan (Tension Pull)",
        "description": "Pose menarik tali, rantai, atau tuas yang sangat berat.",
        "exampleAnime": "A high-detail heroic fantasy illustration. A warrior straining, pulling a massive chain anchored far away. The body is leaned severely backward, legs braced and straight, almost parallel to the ground. Every muscle (traps, lats, biceps) is maximally flexed and highlighted with harsh directional lighting, anime.",
        "exampleRealistic": "Concept art, epic fantasy, strain: A dwarf warrior straining to pull a colossal chain attached to a bridge or gate. The body is leaning severely back, legs locked straight and forward. Focus on the visible lines of effort on the neck and arms, rendering the rough texture of the chain.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure leaning far back, showing a low center of gravity and straight, brace legs. Use strong, thick lines to show the tension running from the hands through the spine to the heels, easy beginner prompt."
      },
      {
        "name": "Menarik Cepat (Quick Draw)",
        "description": "Momen senjata api atau pedang baru saja ditarik dari sarungnya.",
        "exampleAnime": "A Western cinematic scene. A gunslinger, viewed from a slightly low angle, having just drawn his pistol. The drawing hand is fully extended and locked on target, the other hand is near the holster. The body is tense, and a slight puff of smoke emanates from the muzzle, anime.",
        "exampleRealistic": "Concept art, cinematic close-up, Western: A character's hand snapping a futuristic revolver from a holster. The focus is on the blur of the drawing motion and the sharp, locked final position of the drawing arm. Emphasize the detailed mechanism of the gun.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure completing a 'quick draw.' Use minimal lines to emphasize the speed and the final straight line of the extended arm. Focus on the hand's rigid grip, easy beginner prompt."
      },
      {
        "name": "Ayunan Kapak dari Atas (Axe Swing Overhead)",
        "description": "Pose mengayunkan kapak atau palu godam dari atas ke bawah.",
        "exampleAnime": "An epic video game concept art. A barbarian warrior at the apex of an overhead axe swing. The weapon is held vertically above the head, the back is arched in preparation for the downward thrust, and the knees bewildered indifference. Focus on the momentary pause in the action around them, anime.",
        "exampleRealistic": "Concept art, dark fantasy, moment of apex: A hulking beast-man warrior at the absolute top of his overhead axe swing. The back is severely arched, loading all power. Focus on the musculature of the back and the weight/texture of the oversized, brutal weapon.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure at the apex of an overhead swing. Show the exaggerated backward arch of the spine (hyperextension) and the position of the hands high above the head, easy beginner prompt."
      },
      {
        "name": "Blok Perisai (Shield Block)",
        "description": "Momen perisai menerima benturan, tubuh sedikit condong ke belakang untuk menahan.",
        "exampleAnime": "A medieval fantasy illustration. A knight bracing with a large shield held tightly in front of the torso. The stance is wide and low. The knees are bent, and the body leans slightly into the shield, absorbing a powerful blow. Steam or magical energy is visible impacting the shield, anime.",
        "exampleRealistic": "Concept art, medieval battle, impact: A heavily armored soldier bracing behind a large, dented shield that is currently taking a blow. The stance is low and wide. Illustrate the visible force lines and sparks emanating from the point of impact on the shield's metal surface.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a wide, low defensive brace. Highlight the straight, stable arms holding the shield and the locked, compressed position of the knees and hips, easy beginner prompt."
      },
      {
        "name": "Mengumpulkan Momentum (Winding Up)",
        "description": "Pose persiapan, memutar tubuh untuk membangun momentum sebelum melepaskan serangan/lemparan.",
        "exampleAnime": "A sports photography style. A baseball pitcher at the moment of maximal 'wind-up' or counter-rotation. The hips and shoulders are twisted in opposing directions, creating a visible torque in the torso. The pitching arm is extended back, and the non-pivot foot is lifted, anime.",
        "exampleRealistic": "Concept art, sports drama, internal focus: A tennis player at the maximal counter-rotation of a serve. The hips and shoulders are twisted to their limit. Focus on the tension in the clothing and the deep, coiled rotation, conveying immense potential energy about to be released.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a winding-up pose (counter-rotation). Use arrows to illustrate the opposing rotation of the pelvis and ribcage, creating a visible twist in the torso, easy beginner prompt."
      },
      {
        "name": "Serangan Berdiri dengan Tangan (Handstand Attack)",
        "description": "Melakukan serangan sambil menyeimbangkan diri di satu atau dua tangan.",
        "exampleAnime": "A dynamic action sketch. A martial artist performing a handstand, supporting their full weight on one hand, while the legs are split wide for a forceful downward kick. The pose is inverted, emphasizing the core strength required to maintain the vertical line, anime.",
        "exampleRealistic": "Concept art, futuristic melee, inverted view: A fighter inverted in a one-handed handstand, delivering a forceful, vertical kick with the opposite leg. The pose is highly unstable and dynamic. Focus on the extreme core tension required for balance in this inverted position.",
        "exampleAnatomy": "Black and white anatomical sketch. An inverted figure balancing on one hand, legs split. Highlight the straight line of the supporting arm and the tension in the shoulder muscles, easy beginner prompt."
      },
      {
        "name": "Memanjat Naik (Climbing Up)",
        "description": "Pose menarik diri ke atas langkan atau tepi, menggunakan kekuatan lengan.",
        "exampleAnime": "A realistic illustration of a rock climber 'mantling' over a ledge. Both arms are bent and pulling, showing maximal tension in the forearms and biceps. The body is pressed close to the rock surface, legs bent and poised to push up, anime.",
        "exampleRealistic": "Concept art, high-altitude realism, struggle: A stranded climber pulling themselves over a wet, slippery rock ledge. Focus on the strain in the forearms, the desperate grip of the fingers, and the rough, detailed texture of the rock face under dim, high-contrast light.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure pulling themselves up over a ledge. Emphasize the severe bend in the elbows and the contraction of the biceps and lats for the pull, easy beginner prompt."
      },
      {
        "name": "Melempar Tombak (Throwing Spear)",
        "description": "Momen tombak atau lembing dilepaskan, diikuti oleh gerakan maju tubuh.",
        "exampleAnime": "An illustration of an Olympic javelin thrower. The body is fully extended and arched backward like a taut bow immediately before the release. The trailing arm and leg form a long, dynamic diagonal line leading to the spear, anime.",
        "exampleRealistic": "Concept art, historic epic, moment of release: A Greek warrior releasing a javelin with full force. The body is fully extended and arched backward like a taut bow, all energy transferring to the arm. Focus on the dust and speed blur following the spear's trajectory.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure at the point of release (javelin throw). Show the strong backward arch and the follow-through of the hips snapping forward, easy beginner prompt."
      },
      {
        "name": "Luncuran Balik (Backflip Launch)",
        "description": "Pose di awal salto ke belakang, sebelum tubuh berputar penuh.",
        "exampleAnime": "A comic book panel showing a character at the beginning of a rapid backflip. They are low to the ground in a deep squat, arms sweeping up to initiate the rotation. The pose captures the explosive upward thrust. Focus on the bent knees and pushing motion, anime.",
        "exampleRealistic": "Concept art, action sequence, explosive power: A character initiating an explosive backflip from a deep crouch. The force of the jump is visible as an outward ripple on the ground. Focus on the bent knees and the arms sweeping up sharply to generate momentum.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a deep squat, arms raised, initiating an upward jump. Highlight the tension in the glutes and quadriceps muscles responsible for the explosive extension, easy beginner prompt."
      }
    ]
  },
  {
    "id": "style_2_santai",
    "name": "2. POSE SANTAI & RILEX",
    "accentColor": "blue",
    "icon": "fas fa-couch",
    "definition": [
      "Pose yang menunjukkan kurangnya ketegangan, kenyamanan, atau aktivitas non-mendesak.",
      "Memanfaatkan 'Garis Aksi' yang lembut, seringkali berbentuk J atau C, atau garis patah (Contrapposto yang rileks).",
      "Umum digunakan dalam genre Slice of Life, ilustrasi karakter sehari-hari, dan fashion."
    ],
    "subpose": [
      {
        "name": "Berdiri Santai (Contrapposto)",
        "description": "Berdiri dengan santai dengan berat ditopang pada satu kaki, menyebabkan pinggul dan bahu miring berlawanan.",
        "exampleAnime": "A slice-of-life anime background scene. A male character in a relaxed Contrapposto stance. Weight shifted entirely to the straight leg, causing the hip to tilt and the opposite shoulder to drop. One hand is casually slipped into a back pocket. Soft ambient morning light, anime.",
        "exampleRealistic": "Concept art, full-body portrait, gentle light: A weary starship captain standing in a relaxed Contrapposto stance on the bridge, watching the stars. Focus on the gentle S-curve of the spine and the heavy, flowing fabric of the uniform. Soft, ambient lighting.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in Contrapposto. Highlight the tilt of the pelvis and the antagonistic drop of the opposite shoulder. Focus on the weight distribution on the supporting leg, easy beginner prompt."
      },
      {
        "name": "Bersandar di Dinding (Leaning Against Wall)",
        "description": "Bersandar pada permukaan vertikal, biasanya dengan satu bahu atau punggung.",
        "exampleAnime": "A low-key urban photography style. A character leaning with their entire back and one shoulder against a concrete wall. Arms are crossed over the chest in a defensive but relaxed manner. The head is slightly tilted back, gazing upward. The body forms a slight diagonal line, anime.",
        "exampleRealistic": "Concept art, neo-noir alleyway, atmospheric: A detective leaning casually against a damp, brick wall, one foot crossed over the other. Focus on the texture of the trench coat and the strong, vertical line of the wall creating a diagonal body silhouette. Smoke from a cigarette curls up.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure leaning against a vertical plane. Use cross-hatching to define the contact points of the back and the subtle tilt of the spine, easy beginner prompt."
      },
      {
        "name": "Tangan di Saku (Hands in Pockets)",
        "description": "Berdiri atau berjalan dengan kedua tangan tersembunyi di saku celana atau jaket.",
        "exampleAnime": "A muted color manga cover illustration. A female character standing still, both hands completely hidden in the front pockets of her hoodie. The shoulders are slightly hunched forward, emphasizing a feeling of withdrawal or introspection. Gentle light source from the side, anime.",
        "exampleRealistic": "Concept art, urban fashion, detailed clothing: A young, confident street artist standing, both hands deep in the pockets of oversized cargo pants. Shoulders are slightly hunched. Focus on the complex folds and drapes of the thick fabric around the hands and elbows.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure with hands hidden in pockets. Emphasize the tension in the fabric over the pockets and the relaxed, inward slope of the shoulders, easy beginner prompt."
      },
      {
        "name": "Duduk dan Membaca (Sitting and Reading)",
        "description": "Duduk tenang sambil memegang buku, kepala sedikit menunduk.",
        "exampleAnime": "A warm, cozy anime illustration. A person seated comfortably on an old armchair, immersed in reading a book held loosely in both hands. Head is slightly bowed, illuminated by a warm reading lamp. The spine is curved in a relaxed, deep C-shape, anime.",
        "exampleRealistic": "Concept art, cozy fantasy interior: A scholar curled up on a velvet armchair next to a glowing fireplace, deeply immersed in an ancient, illuminated scroll. The head is bowed gently. Focus on the warm lighting and the intricate details of the book/scroll in their hands.",
        "exampleAnatomy": "Black and white anatomical sketch. A seated figure with a relaxed, curved spine (C-curve). Use light, gentle lines. Highlight the supporting elbows and the forward tilt of the neck over the book, easy beginner prompt."
      },
      {
        "name": "Tangan di Belakang Kepala (Arms Behind Head)",
        "description": "Berbaring atau duduk dengan tangan dikaitkan di belakang kepala, siku terbuka lebar.",
        "exampleAnime": "A bright summer day anime illustration. A person lying supine on green grass, arms interlocked behind their head, elbows pointing up. The chest is completely open and relaxed, reflecting a feeling of contentment and ease. View from the ground level looking up, anime.",
        "exampleRealistic": "Concept art, sci-fi leisure deck, open space: A character lounging back on a futuristic observation deck, arms clasped behind the head. The posture is wide open. Focus on the stretched abdominal muscles and the distant, serene view of a planet or nebula.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure with hands behind the head. Emphasize the open ribcage, the lifted scapulae, and the stretched abdominal wall, easy beginner prompt."
      },
      {
        "name": "Duduk Bersila (Crossed Legs Sitting)",
        "description": "Duduk di kursi atau lantai dengan satu kaki disilangkan di atas yang lain (Gaya India atau di atas lutut).",
        "exampleAnime": "An interior scene, focused on posture. A character sitting cross-legged (tailor style) on a rug, maintaining a straight, comfortable spine without tension. Hands are resting palms-up on the knees. Calm, meditative expression, anime.",
        "exampleRealistic": "Concept art, meditation temple, inner focus: A cloaked monk sitting perfectly upright in a full lotus position (Padmasana) on a woven mat. Focus on the straight, unwavering vertical line of the spine and the serene symmetry of the pose. Soft, diffused overhead light.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure sitting cross-legged (tailor position). Use strong vertical lines for the spine. Detail the external rotation of the hip and the symmetrical placement of the feet, easy beginner prompt."
      },
      {
        "name": "Berpikir (Hand on Chin)",
        "description": "Berdiri atau duduk sambil menopang dagu dengan satu tangan, menunjukkan pemikiran mendalam.",
        "exampleAnime": "A dramatic close-up anime portrait with deep shadows. A figure seated at a desk, the chin delicately supported by the index finger and thumb. The eyes are narrowed in deep concentration, and the brow is slightly furrowed. Elbow rests on the surface for support, anime.",
        "exampleRealistic": "Concept art, scholarly study, pensive mood: A figure seated at a large, cluttered wooden table, resting their chin thoughtfully on a closed fist. The expression is one of deep, troubled contemplation. Focus on the slight furrowing of the brow and the texture of the supporting hand.",
        "exampleAnatomy": "Black and white anatomical sketch. A profile of a figure with a hand supporting the chin. Focus on the bone structure of the hand/jaw contact point and the slightly lowered gaze, easy beginner prompt."
      },
      {
        "name": "Melamun (Daydreaming)",
        "description": "Berdiri atau duduk dengan pandangan kosong, seringkali dengan tangan memegang benda kecil (pena, cangkir).",
        "exampleAnime": "A moody, atmospheric anime scene. A person is sitting sideways on a windowsill, looking out at the rain. The hands are resting lightly in their lap, and the gaze is unfocused and distant. The pose is passive and relaxed, showing zero muscle tension, anime.",
        "exampleRealistic": "Concept art, ethereal, gentle rain: A figure sitting on a stone bench, looking passively into the distance. The posture is loose and slightly slumped. Illustrate soft, glowing light and gentle rain falling around them, emphasizing the character's detached, internal state.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a passive, slumped sitting position. Use very soft, non-tense lines. Show the relaxed C-curve of the spine and the minimal muscle definition, easy beginner prompt."
      },
      {
        "name": "Meregangkan Badan dan Menguap (Stretching and Yawning)",
        "description": "Pose meregangkan tubuh setelah bangun tidur atau setelah duduk lama.",
        "exampleAnime": "A simple, fluid anime sketch. A figure standing and performing a full-body stretch and yawn after waking up. Both arms are extended high and reaching, causing the spine to arch backward slightly (inverted C-curve). The body line is highly elongated, anime.",
        "exampleRealistic": "Concept art, sunrise on a mountain peak: A traveler standing and stretching after a long night, arms fully extended high above their head, back arched slightly. Focus on the elongation of the body and the first rays of sun hitting the stretched torso.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a full-body stretch. Exaggerate the inverted C-curve of the spine and the high elevation of the scapulae. Use arrows to show the direction of the stretch, easy beginner prompt."
      },
      {
        "name": "Tangan di Pinggul (Hands on Hips)",
        "description": "Berdiri tegak dengan tangan diletakkan di pinggul, seringkali menunjukkan kepercayaan diri yang santai.",
        "exampleAnime": "A confident anime character portrait. A figure standing square to the camera, both hands placed firmly on the hips with elbows pointing out sharply. The chest is projected slightly forward, conveying a casual but assertive attitude. Symmetric composition, anime.",
        "exampleRealistic": "Concept art, assertive, confident stance: A female general standing on a high platform, both hands placed firmly on her hips. Her posture is wide, symmetrical, and completely assertive. Focus on the heavy, pleated fabric of her uniform and the symmetry of the pose.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure with hands on hips. Use a grid to emphasize the symmetry and verticality. Highlight the jutting elbows and the raised chest line, easy beginner prompt."
      },
      {
        "name": "Duduk di Meja (Sitting at Desk)",
        "description": "Duduk di depan meja, mungkin mengetik, atau hanya bersandar.",
        "exampleAnime": "A realistic indoor anime scene. A student sitting at a cluttered desk, one arm propping up the head/temple, clearly showing exhaustion. The back is slightly slumped (subtle C-curve). The hand supporting the head is the key point of the pose, anime.",
        "exampleRealistic": "Concept art, messy workshop, exhaustion: A genius inventor slouched deeply at a cluttered workbench, using one elbow to prop up a weary head. The back is severely rounded. Focus on the complex tools and blueprints scattered around them, contrasting with the exhausted posture.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure slouched over a desk. Emphasize the severe rounding (kyphosis) of the upper back and the compression in the abdomen, easy beginner prompt."
      },
      {
        "name": "Mengangkat Bahu (Shrugging Shoulders)",
        "description": "Mengangkat bahu dan tangan terbuka, menunjukkan ketidakpedulian atau ketidakmampuan.",
        "exampleAnime": "A full-body anime sketch showing uncertainty. A person standing, the head slightly tilted, and both shoulders lifted high toward the ears. The arms are slightly bent and open, palms facing up, indicating a non-committal, confused, or indifferent gesture. Neutral lighting, anime.",
        "exampleRealistic": "Concept art, candid moment, confusion: A confused citizen standing in a bustling marketplace, shrugging both shoulders high toward their ears, palms open. The expression is one of bewildered indifference. Focus on the momentary pause in the action around them.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure mid-shrug. Highlight the elevated trapezius muscles and the lack of tension in the arms (palms up), easy beginner prompt."
      },
      {
        "name": "Mendengarkan dengan Seksama (Listening Closely)",
        "description": "Kepala sedikit miring, seringkali dengan tangan di dekat telinga, menunjukkan pendengaran yang fokus.",
        "exampleAnime": "A half-body anime portrait. A person is leaning forward intently, the head cocked to one side, and one hand cupped behind the ear to better catch a whisper. The pose emphasizes the concentration on auditory input. Slight forward lean of the torso, anime.",
        "exampleRealistic": "Concept art, espionage, clandestine: A spy leaning intently forward, head sharply cocked to one side, one hand cupped behind the ear to amplify a faint sound. Focus on the intense, narrowed eyes and the strong, forward tilt of the torso.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure leaning forward, head tilted. Detail the stretch in the sternocleidomastoid muscle on the opposite side of the tilt, easy beginner prompt."
      },
      {
        "name": "Mengambil Swafoto (Taking a Selfie)",
        "description": "Memegang ponsel di depan wajah, memiringkan kepala, dengan lengan terentang.",
        "exampleAnime": "A bright, high-energy anime scene. A character holding a phone high and far away with an extended arm, striking a quick pose (e.g., peace sign). The head is tilted playfully toward the 'camera lens'. The pose is asymmetrical and focused on the extended arm line, anime.",
        "exampleRealistic": "Concept art, playful high-tech: A group of cheerful friends taking a dynamic group selfie with a futuristic phone/device. The primary figure's arm is fully extended, capturing the playful tilt of the heads and exaggerated smiles. Focus on the glowing screen.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure with one arm fully extended, holding a small object (phone). Emphasize the straight line of the arm and the rotation of the wrist/hand required to hold the phone, easy beginner prompt."
      },
      {
        "name": "Duduk di Lantai (Lutut Diangkat)",
        "description": "Duduk di kursi atau lantai dengan lutut ditarik ke dada dan lengan melingkari lutut.",
        "exampleAnime": "A vulnerable, indoor anime scene. A person seated on the floor with their knees drawn up close to the chest, and the arms wrapped tightly around the legs. The pose is fully closed and curled inward (maximum C-curve), suggesting shyness, sadness, or a desire for comfort, anime.",
        "exampleRealistic": "Concept art, indoor vulnerability: A lone figure seated on the cold, hard floor of a ruined structure, knees pulled tightly to the chest, arms wrapped around the legs. The pose is completely closed and protective, conveying shyness or sadness.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a closed, huddled position on the floor. Highlight the deep C-curve of the entire spine and the protective positioning of the limbs around the core, easy beginner prompt."
      },
      {
        "name": "Satu Tangan di Pinggul (Rileks)",
        "description": "Berdiri dengan satu tangan di pinggul, bahu rileks, menunjukkan pose menunggu.",
        "exampleAnime": "A casual anime portrait. A figure standing in a subtle Contrapposto, one hand resting lightly on the hip. The shoulder on the same side is slightly raised, while the opposing arm hangs loosely. The expression is patient and relaxed. Gentle tilt in the hips, anime.",
        "exampleRealistic": "Concept art, casual urban scene: A young musician standing casually on the sidewalk, one hand resting loosely on the hip, the other holding a guitar case. Focus on the gentle tilt of the hips and the overall air of relaxed confidence.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a subtle Contrapposto with one hand on the hip. Use a center axis line to show the gentle S-curve of the spine and the hip/shoulder contrast, easy beginner prompt."
      },
      {
        "name": "Tidur (Wajah Menghadap Bawah)",
        "description": "Berbaring telungkup di atas bantal atau meja, lengan disilangkan di bawah kepala.",
        "exampleAnime": "A close-up anime shot on a desk. A character is sleeping deeply, face resting sideways on crossed arms placed on a flat surface. The body lines are completely slack and relaxed, showing the absence of muscle tension. Folds of clothing are soft, anime.",
        "exampleRealistic": "Concept art, war exhaustion, full slack: A soldier collapsed face-down on the ground after a long battle, arms splayed loosely under their head. The body is completely limp and relaxed, showing total physical and mental depletion.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure lying prone (face down) with arms tucked. Use soft, non-directional lines to indicate the total relaxation and slackness of the limbs, easy beginner prompt."
      },
      {
        "name": "Memperbaiki Kacamata (Adjusting Glasses)",
        "description": "Menggunakan satu jari untuk mendorong kacamata kembali ke hidung.",
        "exampleAnime": "A refined, detailed anime illustration. A character using a single index finger to push their spectacles back up the bridge of their nose. The head is slightly tilted down, drawing attention to the precise, delicate action of the hand and finger on the face, anime.",
        "exampleRealistic": "Concept art, sophisticated indoor scene: A meticulous librarian pushing up their thin-rimmed spectacles with the tip of their index finger. Focus on the precise, delicate action of the hand and the intense, focused eyes behind the lenses.",
        "exampleAnatomy": "Black and white anatomical sketch. A close-up on the face and hand. Detail the precise contact point of the finger on the bridge of the nose and the subtle tilt of the head, easy beginner prompt."
      },
      {
        "name": "Menggulir Ponsel (Phone Scrolling)",
        "description": "Duduk atau berdiri sambil melihat ke bawah ke layar ponsel yang dipegang dengan kedua tangan.",
        "exampleAnime": "A realistic, everyday anime scene. A person seated, hunched slightly forward, head bowed deeply (tech neck) while scrolling on a smartphone held in both hands. The posture forms a visible, rounded curve in the upper back and neck, anime.",
        "exampleRealistic": "Concept art, modern isolation, low light: A character seated alone in a dark, futuristic train car, head bowed severely over a glowing handheld device. Focus on the harsh light from the screen illuminating the strained neck and rounded shoulders.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in the 'tech neck' posture. Exaggerate the forward curve of the neck (cervical spine) and the rounding of the upper back (thoracic kyphosis), easy beginner prompt."
      },
      {
        "name": "Mengikat Rambut (Tied Hair)",
        "description": "Pose saat mengikat rambut ke belakang, kedua tangan terangkat di dekat kepala.",
        "exampleAnime": "A dynamic anime portrait from the back. A figure with both arms raised high above the head, hands actively gathering hair into a ponytail. The pose emphasizes the stretched lines of the armpits, neck, and shoulders. Neck is elongated, anime.",
        "exampleRealistic": "Concept art, backstage drama, focused action: A performer quickly gathering their long hair into a tight bun/ponytail just before going on stage. Both arms are fully raised, emphasizing the stretched lines of the torso and neck. Focus on the tension in the upward reach.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure with both arms extended high above the head. Highlight the stretched serratus anterior and the full range of motion in the shoulder joint, easy beginner prompt."
      },
      {
        "name": "Menghangatkan Tangan (Warming Hands - Rubbing)",
        "description": "Menggosok kedua tangan di depan dada untuk menghasilkan kehangatan.",
        "exampleAnime": "A character in a snowy or cold environment, viewed from the front, showing the huddled, enclosed posture, anime.",
        "exampleRealistic": "Concept art, desolate winter scene, huddled: A lonely figure standing in a severe blizzard, hunched over, vigorously rubbing their hands together near their chest for warmth. Focus on the heavy, wind-whipped cloak and the closed, protective body posture.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a cold, huddled stance. Use heavy shadow and inward curving lines. Show the protective tuck of the head and the raised shoulders, easy beginner prompt."
      },
      {
        "name": "Berlutut dan Berdoa (Kneeling and Praying)",
        "description": "Berlutut di tanah dengan tangan terkunci di depan dada atau wajah.",
        "exampleAnime": "A solemn, low-light anime illustration. A figure kneeling upright (seiza position), hands clasped together (anjali mudra) and raised to the chest or face. The spine is straight, and the focus is entirely on the hands and the bowed head. Pose conveys deep submission and focus, anime.",
        "exampleRealistic": "Concept art, spiritual sanctuary, solemnity: A figure kneeling (Seiza position) on a worn stone floor, hands clasped tightly in front of the chest, head slightly bowed. Focus on the rigid, vertical line of the spine and the serene symmetry of the pose. Diffused light source.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure kneeling in prayer. Use symmetrical, straight lines for the spine. Detail the position of the clasped hands as the central focal point, easy beginner prompt."
      },
      {
        "name": "Duduk dengan Lutut Diangkat (Tangan di Lutut)",
        "description": "Duduk dengan kaki lurus, lutut ditekuk, dan lengan bawah bersandar di lutut.",
        "exampleAnime": "A contemplative outdoor anime scene. A figure seated on a stone ledge, legs extended with knees slightly bent, and forearms resting casually on the knees. The posture is open and stable, suitable for long observation. The head is upright, looking into the distance, anime.",
        "exampleRealistic": "Concept art, contemplative outdoor: A traveler seated on a rocky cliff edge, legs stretched out, forearms resting heavily on their bent knees. The head is held upright, gazing into the vast distance. Focus on the texture of the rough clothing and the stability of the posture.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure seated with forearms resting on knees. Emphasize the contact points of the elbows and the stable, wide foundation of the lower body, easy beginner prompt."
      },
      {
        "name": "Memegang Minuman (Holding Drink)",
        "description": "Pose santai sambil memegang cangkir atau botol, seringkali di satu tangan.",
        "exampleAnime": "A cozy, focused anime portrait. A person seated, holding a warm mug of coffee with both hands, bringing it close to their face. The head is slightly bowed, and the eyes are softly closed, focusing on the sensory experience. Gentle, warm light, anime.",
        "exampleRealistic": "Concept art, cozy indoor scene, warmth: A person seated at a table, holding a steaming mug of tea with both hands, bringing it close to their face. The pose is intimate and focused. Focus on the warm steam rising and the gentle, relaxed grip on the mug.",
        "exampleAnatomy": "Black and white anatomical sketch. A close-up on the hands holding a cup. Detail the relaxed, gentle grip of the fingers, focusing on the lack of tension in the forearm, easy beginner prompt."
      },
      {
        "name": "Melihat ke Belakang (Looking Back Over Shoulder)",
        "description": "Berdiri atau berjalan, dan hanya memutar kepala untuk melihat ke belakang.",
        "exampleAnime": "A dynamic half-body anime portrait. A character mid-stride, but their head is maximally rotated backward over one shoulder to look at an unexpected sound/person. The torso remains facing forward, emphasizing the tension in the neck muscles, anime.",
        "exampleRealistic": "Concept art, mystery, high tension: A figure walking away, but their head is maximally rotated backward over one shoulder to meet the viewer's gaze. The torso remains facing forward. Focus on the visible strain in the neck muscles and the intense, suspicious eyes.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure with the head maximally rotated over the shoulder. Use a strong line to show the spinal rotation and highlight the contracted sternocleidomastoid muscle (neck), easy beginner prompt."
      }
    ]
  },
  {
    "id": "style_3_emosional",
    "name": "3. POSE EMOSIONAL & EKSPRESIF",
    "accentColor": "yellow-600",
    "icon": "fas fa-face-grin-tears",
    "definition": [
      "Pose yang utamanya ditujukan untuk menyampaikan keadaan mental atau perasaan yang kuat.",
      "Seluruh tubuh (termasuk postur, tangan, dan kaki) mendukung ekspresi wajah.",
      "Menggunakan simetri untuk kesedihan/rasa malu, dan asimetri untuk kegembiraan/kemarahan."
    ],
    "subpose": [
      {
        "name": "Kegembiraan Luar Biasa (Overwhelming Joy)",
        "description": "Ekspresi kegembiraan yang meluap, seringkali dengan tangan diangkat di udara.",
        "exampleAnime": "A bright, celebratory anime illustration. A figure jumping slightly off the ground, both arms thrown wide open and upward in a dramatic V-shape. The face has an exaggerated, beaming smile, with the head tilted back slightly in pure, uninhibited elation. High-key lighting, anime.",
        "exampleRealistic": "Concept art, high energy, victory moment: A protagonist jumping slightly off the ground, arms flung wide open in an uninhibited, dramatic V-shape of pure elation. Intense backlighting creates a heroic silhouette. Focus on the open, expressive face.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure with arms thrown up in a V-shape. Use flowing lines to show the open chest and the slight backward arch (inverted C-curve) of the spine, easy beginner prompt."
      },
      {
        "name": "Kesedihan Mendalam/Menangis (Deep Grief/Crying)",
        "description": "Pose kesedihan yang mendalam, kepala tertunduk atau tersembunyi di tangan.",
        "exampleAnime": "A deeply shadowed, dramatic anime scene. A person is crouched low, kneeling on the ground, their head completely hidden and buried into their arms or knees. The entire body is curved and shrinking inward (closed pose), conveying overwhelming, visceral despair. Focus on the hunched, shaking shoulders, anime.",
        "exampleRealistic": "Concept art, heavy shadow, visceral grief: A figure crouched low, kneeling, completely bowed over, head buried deep into their arms and knees. The entire body is a small, curled knot of despair. Focus on the heavy drapes of clothing hiding the form, emphasizing the hunched shoulders.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a tight, curled-up crouch of despair. Emphasize the extreme C-curve of the spine and the protective positioning of the arms and legs, easy beginner prompt."
      },
      {
        "name": "Kemarahan Intens (Intense Anger)",
        "description": "Ekspresi kemarahan ekstrem, tangan terkepal, tubuh condong ke depan.",
        "exampleAnime": "A high-contrast comic book panel. A character standing rigid, leaning aggressively forward, fists clenched so tightly the knuckles are white. The jaw is set, and neck veins are prominent with rage. The posture is frontal and threatening, with zero ambiguity, anime.",
        "exampleRealistic": "Concept art, dramatic contrast, threatening: A character standing rigidly, leaning aggressively forward, jaw clenched, eyes narrowed, with fists tight at their sides. Veins are subtly highlighted on the neck/forearms. Focus on the forward tilt and the zero ambiguity of the pose.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a rigid, aggressive forward lean. Use short, sharp lines and heavy shading to imply muscle tension in the neck, jaw, and forearms, easy beginner prompt."
      },
      {
        "name": "Keputusasaan Total/Hancur (Total Despair/Broken)",
        "description": "Tubuh yang hancur, kehilangan kekuatan, ambruk tanpa daya ke tanah.",
        "exampleAnime": "A realistic sketch of ultimate exhaustion and failure. A figure is slumped against a wall or lying prone, all muscular tension lost. The limbs are loosely spread, lacking the power to support the body. The pose is characterized by complete, heavy relaxation (limpness) due to emotional breakdown, anime.",
        "exampleRealistic": "Concept art, ruined environment, total defeat: A figure completely collapsed, slumped against a rubble-covered wall, all muscular tension lost. The head hangs low, and the limbs are slack. Focus on the heavy, passive weight of the body.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure slumped and passive. Use soft, heavy lines to show the lack of supporting tension. Emphasize the limpness of the neck and the rounded spine, easy beginner prompt."
      },
      {
        "name": "Kaget/Horor (Shock/Horror)",
        "description": "Reaksi terkejut yang ekstrem, mulut terbuka lebar, tangan seringkali menutupi mulut atau terangkat ke wajah.",
        "exampleAnime": "A dynamic three-quarter view. A person standing with a sudden, sharp intake of breath, body recoiling backward, arms flung outward in defense or disbelief. The eyes are wide, and the mouth is open. The pose is off-balance, demonstrating a sharp shift away from the threat, anime.",
        "exampleRealistic": "Concept art, sudden, sharp recoil: A figure sharply jumping backward from a sudden, terrifying sight. The body is recoiling, arms flung outward/upward defensively, eyes wide in horror. The pose is dynamic, showing an immediate shift away from the threat.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure recoiling in shock. Use sharp, jagged lines and an unstable, off-balance posture. Detail the upward thrust of the arms and the defensive position, easy beginner prompt."
      },
      {
        "name": "Pembangkangan/Tantangan (Defiance/Challenge)",
        "description": "Berdiri tegak dengan sikap menantang, tangan di pinggul atau lengan disilangkan, mata lurus ke depan.",
        "exampleAnime": "A low-angle shot emphasizing power. A character standing firmly with legs wide apart, chest pushed out, and hands crossed confidently over the chest. The head is slightly tilted up, making direct, unwavering eye contact with the viewer. The stance is aggressively symmetric, anime.",
        "exampleRealistic": "Concept art, cinematic low angle, powerful stance: A lone figure standing on elevated ground, legs wide, chest pushed out, arms crossed tightly over the chest. The head is tilted slightly up, asserting unwavering authority. Focus on the strong, symmetric silhouette.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a wide, symmetrical, defiant stance. Use a grid to show the stable, low center of gravity. Highlight the horizontal line of the crossed arms as a barrier, easy beginner prompt."
      },
      {
        "name": "Rasa Malu (Covering Face)",
        "description": "Menutupi wajah dengan satu atau kedua tangan karena rasa malu atau canggung.",
        "exampleAnime": "A soft, tender anime portrait. A figure standing, head slightly bowed, with one or both hands covering the flushed cheeks and lower face. The pose is closed and shy, attempting to hide the reaction. The fingers lightly touch the skin, anime.",
        "exampleRealistic": "Concept art, intimate moment, shy vulnerability: A figure standing with head bowed, one hand covering the flushed cheeks and lower face. The fingers are lightly touching the skin. Focus on the delicate, protective gesture and the inward, shrinking body language.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure with the head bowed and one hand covering the face. Focus on the precise contact points of the fingers on the cheek/eye area, easy beginner prompt."
      },
      {
        "name": "Tekad Kuat (Fierce Determination)",
        "description": "Fokus intens, tangan terkepal di samping, tubuh sedikit condong ke depan, siap beraksi.",
        "exampleAnime": "A close-up on the upper body. The character's shoulders are squared, the torso is perfectly upright and rigid, and the hands are clenched tightly at the sides. The neck is held stiffly. The entire focus is on the intensely narrowed, resolute gaze and the set jawline, anime.",
        "exampleRealistic": "Concept art, high focus, rigid intensity: A character standing absolutely rigid and upright, eyes narrowed with intense resolve, fists clenched tightly at their sides. The posture is one of immovable, internal strength. Focus on the subtle tension lines around the jaw and neck.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a rigid, determined stance. Use thick, straight lines for the body. Detail the extreme clench of the fists and the stiff, vertical line of the neck, easy beginner prompt."
      },
      {
        "name": "Rayuan/Menggoda (Seduction/Flirtation)",
        "description": "Pose menggoda, seringkali melibatkan sentuhan pada rambut, melihat ke balik bahu, atau condong ke depan.",
        "exampleAnime": "A stylish anime portrait with soft focus. A character in a relaxed Contrapposto, one hand gently touching their neck or hair, and the head is tilted back to look over the shoulder. The body forms a subtle, alluring S-curve. The pose is inviting and intimate, anime.",
        "exampleRealistic": "Concept art, smoky bar, allure: A femme fatale leaning casually against a bar, one hand gently tracing the line of her neck and hair. The body forms a subtle, alluring S-curve. Focus on the shadow and light, emphasizing the soft curves and exposed neck area.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a seductive S-curve pose. Exaggerate the hip and shoulder tilt. Highlight the gentle, non-tensed touch of the hand on the neck/collarbone area, easy beginner prompt."
      },
      {
        "name": "Apatis/Bosan (Apathy/Boredom)",
        "description": "Pose lesu, berat badan di satu kaki, tangan di saku, mata setengah tertutup.",
        "exampleAnime": "A realistic anime character study in a classroom. A student slouched deeply in their chair, body visibly sagging, one arm holding up the chin with minimal effort. The eyes are half-closed, and the posture shows a complete lack of interest or motivation, anime.",
        "exampleRealistic": "Concept art, mundane, complete slouch: A figure slumped deeply in a metallic, uncomfortable chair, one elbow supporting a weary head, eyes half-closed. The posture shows total disengagement. Focus on the extreme rounding of the back and the limpness of the unused limbs.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in an extreme, slumped position. Emphasize the structural failure of the spine (deep C-curve). Use soft, heavy lines to show the lack of muscle engagement, easy beginner prompt."
      },
      {
        "name": "Memohon/Meminta (Pleading/Begging)",
        "description": "Tangan terkunci di depan dada atau wajah, kepala menunduk ke depan, mata memohon.",
        "exampleAnime": "A full-body anime illustration showing vulnerability. A person standing, leaning forward slightly, hands pressed together in a desperate plea (prayer gesture). The eyes are directed upwards, seeking mercy. The body language is completely submissive and open, anime.",
        "exampleRealistic": "Concept art, vulnerable, desperate appeal: A character standing, leaning forward slightly, hands pressed together in a desperate plea (prayer gesture) raised toward the viewer. The gaze is upturned and desperate. The body language is submissive and open.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a pleading stance. Highlight the clasped hands as the central focus. Show the slight forward lean of the torso in supplication, easy beginner prompt."
      },
      {
        "name": "Rahasia/Berbisik (Secretive/Whispering)",
        "description": "Satu orang mendekat ke telinga orang lain, satu tangan menutupi mulut pembicara.",
        "exampleAnime": "A candid street photography anime shot. Two figures leaned in close to each other, one speaking directly into the other's ear. The speaker's hand is cupped near their mouth to shield the sound, creating a highly specific, closed contact point. Strong forward lean, anime.",
        "exampleRealistic": "Concept art, dark fantasy, clandestine: Two figures huddled tightly together, leaning in so close their heads almost touch, one whispering into the other's ear, a hand cupped over the mouth. Focus on the tight, closed-off space they create.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures with their heads close together in a conspiratorial C-curve. Detail the position of the hands cupping the mouth and ear, easy beginner prompt."
      },
      {
        "name": "Arogansi/Superioritas (Arrogance/Superiority)",
        "description": "Dada dibusungkan, kepala diangkat tinggi, seringkali dengan lengan disilangkan atau dikunci di belakang punggung.",
        "exampleAnime": "An aristocratic anime portrait. A figure standing with a vertical spine, chin sharply raised, and hands clasped behind the lower back. The chest is prominently puffed out. The high angle of the head forces the gaze downward, emphasizing haughtiness and control, anime.",
        "exampleRealistic": "Concept art, imperial, haughty: A villain standing perfectly upright on a high platform, chin sharply raised, and hands clasped formally behind the lower back. The chest is thrust forward in an overconfident display. Focus on the high angle of the head.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a rigid, arrogant posture. Exaggerate the upward tilt of the chin and the stiff, extended posture of the arms clasped behind the back, easy beginner prompt."
      },
      {
        "name": "Kelegaan/Kelelahan (Relief/Exhaustion)",
        "description": "Tangan menopang lutut atau kepala tertunduk setelah momen stres besar.",
        "exampleAnime": "A dramatic moment of repose. A figure bent over, hands placed on the knees to support the upper body, head hanging low. This pose emphasizes the labored breathing and the need for immediate support after intense physical exertion. The back is heavily curved, anime.",
        "exampleRealistic": "Concept art, post-conflict exhaustion, weight support: A warrior bent over double, hands pressed firmly onto their knees, head hanging low, gasping for breath after a major fight. The body is relying entirely on the arms for support. Focus on the strained muscles of the back.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure bent over, hands on knees. Highlight the extreme rounding (C-curve) of the back and the rigid, weight-bearing line of the arms, easy beginner prompt."
      },
      {
        "name": "Pencerahan Mendadak (Sudden Realization - Aha!)",
        "description": "Tangan terkepal di sisi kepala atau di udara, mata melebar saat mendapatkan ide.",
        "exampleAnime": "A dynamic cartoon/comic style anime illustration. A character suddenly snaps upright from a seated position, one hand balled into a fist and striking the palm of the other hand, or pointing dramatically upwards. Eyes are wide open with sudden inspiration. The body is galvanized into action, anime.",
        "exampleRealistic": "Concept art, bright, dramatic snap: A character suddenly snapping upright from a contemplative position, one fist striking the palm of the other hand, eyes wide with sudden, urgent inspiration. Use sharp lines to convey the explosive, quick movement.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a sudden 'aha!' pose. Use a sharp, vertical line to show the rapid upright movement. Highlight the dynamic position of the arms and the focus on the head, easy beginner prompt."
      },
      {
        "name": "Keraguan/Skeptisisme (Doubt/Skepticism)",
        "description": "Alis terangkat, kepala sedikit miring ke samping, lengan disilangkan di dada.",
        "exampleAnime": "A half-body casual anime shot. A character standing with arms crossed firmly across the chest (defensive barrier), head tilted sideways, and eyebrows slightly raised in an expression of mistrust or disbelief. The body is relaxed but closed off, anime.",
        "exampleRealistic": "Concept art, defensive, critical stance: A figure standing with arms crossed firmly over the chest (a barrier), head tilted slightly sideways, eyes narrowed in critical disbelief. Focus on the closed, defensive body language and the raised eyebrow.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure with arms crossed. Emphasize the horizontal line of the arms acting as a shield and the slight, critical tilt of the head, easy beginner prompt."
      },
      {
        "name": "Kegembiraan/Tepuk Tangan (Excitement/Clapping)",
        "description": "Tangan bertepuk di depan dada atau di atas kepala, tubuh sedikit condong ke depan.",
        "exampleAnime": "A vibrant action anime scene. A figure standing with legs apart for stability, clapping hands enthusiastically above their chest or head. The head is tilted back, showing an open-mouth smile. The whole body radiates high, positive energy, anime.",
        "exampleRealistic": "Concept art, vibrant celebration: A crowd of figures enthusiastically clapping hands high above their chest, smiling widely. The movements are chaotic and uncoordinated, conveying uncontrolled, positive energy. Focus on the rapid, repetitive motion of the hands.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure clapping. Use repetition/motion lines to show the quick, rhythmic movement of the hands. Highlight the raised shoulders and open chest, easy beginner prompt."
      },
      {
        "name": "Menyembunyikan Diri/Malu (Hiding/Shame)",
        "description": "Bersembunyi di balik objek atau punggung orang lain, tubuh menyusut (meringkuk).",
        "exampleAnime": "A vulnerable, cowering anime pose. A person is hunched low, minimizing their profile, with their head pulled down into the shoulders. They are trying to shield themselves, making the body form a small, tight knot of protection, anime.",
        "exampleRealistic": "Concept art, cowering, fear: A figure hunched low to the ground, pulling their head deep into their shoulders, minimizing their profile behind a small obstacle. The posture is one of deep shame or self-protection, making a small, tight knot of flesh.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a deep, protective crouch. Emphasize the rounded spine and the arms creating a small, shielded space around the torso, easy beginner prompt."
      },
      {
        "name": "Melambaikan Tangan (Waving Goodbye - Energetic)",
        "description": "Melambaikan tangan dengan gerakan besar, tubuh dan kepala berputar mengikuti gerakan lengan.",
        "exampleAnime": "A dynamic, farewell anime scene. A figure standing on tiptoes, leaning slightly forward, with one arm fully extended and waving enthusiastically above the head. The other hand is often bracing on a surface. The body is open and reaching outward, anime.",
        "exampleRealistic": "Concept art, emotional farewell, reaching out: A figure standing on a dock or ledge, leaning far forward, one arm fully extended and waving a large, emotional goodbye. The body is open and reaching outward, emphasizing the stretch and effort.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure waving enthusiastically. Highlight the full extension of the arm from the shoulder to the fingertips. Use flowing lines to show the outward movement, easy beginner prompt."
      },
      {
        "name": "Frustrasi/Menarik Rambut (Frustration/Hair Pulling)",
        "description": "Tangan mengacak-acak rambut atau menarik wajah karena frustrasi.",
        "exampleAnime": "A high-tension anime portrait. A figure sitting, bent forward, with both hands raking tightly through their hair and pulling it away from the forehead. The pose emphasizes mental anguish and stress, with strong, visible tension in the arms and jaw, anime.",
        "exampleRealistic": "Concept art, mental anguish, tight tension: A figure sitting, bent forward, with both hands raking tightly and desperately through their hair. Focus on the visible tension in the forearms, the strain in the bent elbow, and the downward pull of the hands on the hair.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure with hands pulling hair, head bowed. Detail the tense, contracting forearm muscles and the downward force exerted by the hands on the scalp, easy beginner prompt."
      },
      {
        "name": "Menguping (Listening - Eavesdropping)",
        "description": "Condong ke depan, tangan diletakkan di dekat telinga, seringkali tersembunyi di balik pintu atau sudut.",
        "exampleAnime": "A sneaky, low-profile anime pose. A person crouched low behind an object (like a door frame), leaning their head forward with great care to listen intently. The body line is highly asymmetrical and curved, designed to be hidden, anime.",
        "exampleRealistic": "Concept art, clandestine, hidden: A spy crouched low behind a pillar, leaning their head forward with extreme care to listen. The body is curved and highly asymmetrical, designed to be completely hidden. Focus on the tension in the neck and the narrowed eyes.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a low, forward crouch, head tilted. Emphasize the low, secretive profile and the forward thrust of the head and ear towards the sound source, easy beginner prompt."
      },
      {
        "name": "Kemenangan/Kegagahan (Triumph/Victory)",
        "description": "Satu atau kedua tangan diangkat di udara, kepala diangkat tinggi, seringkali di atas lutut.",
        "exampleAnime": "An epic, victorious anime moment. A figure is kneeling on one knee, head raised high, with one fist punched into the air. The chest is expanded in pride, and the lighting is dramatic, highlighting the heroic silhouette. Full-body display of achievement, anime.",
        "exampleRealistic": "Concept art, epic low angle, heroic: A protagonist standing on a pile of defeated foes/rubble, one fist punched dramatically into the air. The chest is expanded in pride. Low-angle lighting creates a powerful, chiseled silhouette.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure in a triumphant stance (fist raised). Highlight the open chest, the proud backward curve of the spine, and the vertical line of the raised arm, easy beginner prompt."
      },
      {
        "name": "Terkejut (Jumping Back)",
        "description": "Reaksi cepat melompat ke belakang karena kejutan mendadak.",
        "exampleAnime": "An exaggerated, immediate reaction shot. A person has sharply jumped backward, both feet slightly off the ground, knees bent, and arms thrown up defensively near the face. The body is recoiling from an immediate shock, anime.",
        "exampleRealistic": "Concept art, sudden shock, involuntary: A figure instantly jumping backward, feet momentarily off the ground, knees sharply bent, arms thrown up defensively. The expression is one of pure, immediate, involuntary shock. Focus on the sharp, angular body position.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure mid-recoil jump. Use sharp, broken lines to show the immediate, uncontrolled lift-off from the ground and the defensive arm position, easy beginner prompt."
      },
      {
        "name": "Memohon (Kneeling)",
        "description": "Berlutut di tanah, wajah menghadap ke atas, lengan terentang memohon bantuan.",
        "exampleAnime": "A dramatic, emotional anime scene. A figure is kneeling on both knees, head slightly bowed, with arms stretched out imploringly towards an unseen character. The pose is one of total submission and desperate appeal, anime.",
        "exampleRealistic": "Concept art, dramatic submission: A character kneeling low on both knees on a rough, textured surface, arms stretched out imploringly towards the viewer. The neck is exposed and vulnerable. Focus on the open, desperate hand gesture.",
        "exampleAnatomy": "Black and white anatomical sketch. A figure kneeling with arms outstretched. Emphasize the submissive posture (low hips, curved spine) and the open, non-threatening palms, easy beginner prompt."
      },
      {
        "name": "Mengusap Air Mata (Wiping Away Tears)",
        "description": "Satu jari atau tangan mengusap air mata dari mata.",
        "exampleAnime": "A close-up profile. A figure looking downwards, one hand (or the back of the hand/fingers) delicately wiping a single tear track away from the eye/cheek area. The pose is subtle, emphasizing a quiet, controlled display of sadness, anime.",
        "exampleRealistic": "Concept art, tender portrait, quiet sadness: A character looking downward, a single finger delicately tracing and wiping away a tear track on the cheek. Focus on the soft, precise action of the fingertip on the skin and the subtle expression of contained grief.",
        "exampleAnatomy": "Black and white anatomical sketch. A close-up on the face and hand. Detail the soft, precise contact of the finger and the downward tilt of the head, easy beginner prompt."
      }
    ]
  },
  {
    "id": "style_4_interaksi",
    "name": "4. POSE INTERAKSI & KELOMPOK",
    "accentColor": "green",
    "icon": "fas fa-handshake",
    "definition": [
      "Pose yang melibatkan dua atau lebih karakter dan berfokus pada hubungan spasial atau fisik di antara mereka.",
      "Membutuhkan komposisi yang hati-hati untuk memastikan pembaca tahu siapa yang berinteraksi dengan siapa.",
      "Garis pandang dan titik kontak fisik adalah kunci."
    ],
    "subpose": [
      {
        "name": "Jabat Tangan (Handshake - Bisnis)",
        "description": "Dua orang berdiri berhadapan, berjabat tangan dengan erat, menunjukkan persetujuan atau sapaan formal.",
        "exampleAnime": "A high-stakes business anime illustration. Two figures standing upright and facing each other, executing a firm, formal two-handed handshake. The bodies are rigid and symmetric, emphasizing professionalism and agreement. The point of contact (the hands) is centered and in sharp focus, anime.",
        "exampleRealistic": "Concept art, formal meeting, tense negotiation: Two powerful executives standing stiffly, performing a firm, formal two-handed handshake. Focus on the strong, rigid verticality of their bodies and the visible tension/control in the hands.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures in a handshake. Use straight, rigid lines for the bodies. Detail the interlocking grip of the hands as the central focus, easy beginner prompt."
      },
      {
        "name": "Pelukan Menenangkan (Comforting Hug)",
        "description": "Pelukan lembut, satu karakter memeluk yang lain, seringkali dengan kepala bersandar di bahu.",
        "exampleAnime": "A tender, emotional anime illustration. Two characters locked in a close, protective embrace. The 'giver' stands firm, cradling the other's head into their shoulder, with one hand gently stroking their back. The 'receiver' is slumped inward. The pose is highly asymmetrical, showing protection, anime.",
        "exampleRealistic": "Concept art, emotional healing, intimate focus: Two figures locked in a protective embrace. The 'giver' (supporter) stands firm, cradling the receiver's head into their shoulder. Focus on the contrast between the receiver's curled, relaxed slump and the giver's rigid, supporting posture.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures hugging. Use a strong vertical line for the supporter and a soft C-curve for the receiver. Highlight the enveloping arms and the contrast in muscle tone, easy beginner prompt."
      },
      {
        "name": "High Five/Tinju (Fist Bump)",
        "description": "Dua orang menyentuh tangan (high five) atau tinju (fist bump) di udara, merayakan.",
        "exampleAnime": "A dynamic, fun anime scene. Two figures jumping slightly, arms shooting outward to meet in a perfect, explosive fist bump. The heads are close together, smiling excitedly. The energy is concentrated on the moment of hand contact, anime.",
        "exampleRealistic": "Concept art, dynamic team celebration, explosive: Two soldiers mid-jump, arms shooting outward for an explosive, mid-air fist bump. The heads are close, yelling in triumph. Focus on the moment of metallic glove-to-glove impact.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures connecting in a fist bump. Highlight the straight, parallel lines of the arms leading to the central point of contact (the fists), easy beginner prompt."
      },
      {
        "name": "Menggendong Pengantin (Carrying Bride Style)",
        "description": "Satu karakter mengangkat yang lain, menggendong mereka di dada.",
        "exampleAnime": "A dramatic anime rescue scene. A strong figure carrying a second, relaxed/unconscious figure across their chest (bridal carry). The carrier's center of gravity is low and stable, while the carried figure's body is limp and curved to fit the carrier's arms. Focus on the contrasting body tensions, anime.",
        "exampleRealistic": "Concept art, heroic rescue, strain vs. slack: A strong hero carrying a seemingly unconscious companion across their chest (bridal style). Focus on the tremendous strain visible on the carrier's arms and legs, contrasting with the complete limpness (slack lines) of the carried figure.",
        "exampleAnatomy": "Black and white anatomical sketch. One figure carrying another (bridal carry). Highlight the low, stable center of gravity of the carrier and the relaxed, curved body of the carried person, easy beginner prompt."
      },
      {
        "name": "Bertengkar/Berteriak (Argument/Shouting Match)",
        "description": "Dua karakter berdiri sangat dekat, menunjuk atau memegang kerah lawan.",
        "exampleAnime": "A highly aggressive anime confrontation panel. Two figures standing toe-to-toe, leaning aggressively into each other, one pointing a finger near the opponent's face. The posture is tense and confrontational, with hands and faces as the primary focus of the conflict, anime.",
        "exampleRealistic": "Concept art, raw confrontation, close quarters: Two characters standing toe-to-toe, leaning aggressively forward, one pointing a tense finger directly into the opponent's face. Focus on the forward tilt of the torsos and the intense strain lines on the necks and jaws.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures in a confrontation. Use sharp, aggressive lines. Emphasize the close proximity and the forward tilt of the entire body mass, easy beginner prompt."
      },
      {
        "name": "Menari Berpasangan (Partners Dancing - Waltz)",
        "description": "Dua karakter dalam posisi menari formal, dengan satu tangan dipegang dan yang lain di bahu/pinggang.",
        "exampleAnime": "A classic, elegant anime illustration of ballroom dancing. Two figures in the closed waltz hold, one hand clasped high, the other at the partner's back. The heads are turned slightly away, and the bodies move as one unit, emphasizing fluid, synchronized movement, anime.",
        "exampleRealistic": "Concept art, elegant ballroom, fluid movement: Two figures gliding across a grand hall in a formal waltz hold. The hands are connected, and the bodies are closely aligned, creating a single, fluid unit. Focus on the dramatic, flowing movements of the elaborate formal wear.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures in a waltz hold. Show the connection points (hands, shoulder/back) and the synchronized movement of the legs, easy beginner prompt."
      },
      {
        "name": "Bergandengan Tangan (Hand-Holding - Romantis)",
        "description": "Dua karakter berjalan berdampingan, tangan digenggam dengan lembut.",
        "exampleAnime": "A warm, cinematic anime shot. Two characters walking side-by-side, hands gently clasped in the center between them. The bodies are relaxed and parallel, suggesting comfort and companionship. The hands form a small, relaxed focal point, anime.",
        "exampleRealistic": "Concept art, tranquil companionship: Two figures walking side-by-side through a calm, beautiful landscape, hands clasped gently between them. The bodies are parallel and relaxed, conveying intimacy and peace. Focus on the gentle, soft grip of the hands.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures walking side-by-side holding hands. Highlight the relaxed, hanging position of the arms and the simple, intimate connection of the hands, easy beginner prompt."
      },
      {
        "name": "Menggendong di Punggung (Piggyback Ride)",
        "description": "Satu karakter menopang yang lain di punggung mereka.",
        "exampleAnime": "A joyful, casual anime illustration. A figure giving another a piggyback ride. The carrier stands upright with slightly bent knees for stability, while the carried person's arms are wrapped around the carrier's neck, and their legs are wrapped around the waist. Focus on the secure, stable weight distribution, anime.",
        "exampleRealistic": "Concept art, joyful interaction, playful: A character giving another a cheerful piggyback ride. The carrier's posture is solid and slightly bent, while the carried person's body is buoyant and light, arms wrapped loosely around the neck. Focus on the secure, stable weight distribution.",
        "exampleAnatomy": "Black and white anatomical sketch. One figure carrying another (piggyback ride). Highlight the strong, contracting back and shoulder muscles of the carrier and the light, wrapping limbs of the carried person, easy beginner prompt."
      },
      {
        "name": "Swafoto Kelompok (Group Selfie)",
        "description": "Tiga atau lebih karakter berkerumun, kepala berdekatan, satu tangan memegang kamera.",
        "exampleAnime": "A fun, crowded anime photograph. Five friends huddled together tightly, all heads tilted inward toward a central phone held by an outstretched arm. The composition is circular, focusing all attention inward on the faces and the act of taking the photo, anime.",
        "exampleRealistic": "Concept art, crowded, fun moment: Four friends tightly huddled together, all smiling and tilting their heads inward towards a central, outstretched arm holding a futuristic camera. Focus on the compressed, inward-facing group dynamic.",
        "exampleAnatomy": "Black and white anatomical sketch. A group of figures with heads tilted inward toward a central point (the camera). Emphasize the compact, rounded shape of the cluster, easy beginner prompt."
      },
      {
        "name": "Menyelamatkan/Menangkap (Rescue/Catch)",
        "description": "Satu karakter baru saja menangkap yang lain yang jatuh, lengan melingkari pinggang.",
        "exampleAnime": "A dramatic anime moment of salvation. A figure has just caught a falling person, cradling them securely in their arms. The catcher's body is tensed and bracing, while the caught person's body is relaxed and drooping in a C-curve, contrasting tension and release, anime.",
        "exampleRealistic": "Concept art, mid-fall, dramatic save: A strong figure having just caught a falling companion, arms tightly braced around the waist. The catcher's body is rigid and tensed, while the caught person is limp and curved in a C-shape. Focus on the intense contrast in body tension.",
        "exampleAnatomy": "Black and white anatomical sketch. One figure catching a falling one. Use a rigid line for the catcher and a loose, curved line for the caught person. Detail the strong, stabilizing posture of the catcher's legs, easy beginner prompt."
      },
      {
        "name": "Berbagi Rahasia (Heads Together)",
        "description": "Dua karakter berdekatan, kepala hampir bersentuhan (seperti 'gosip').",
        "exampleAnime": "An intimate, candid anime shot. Two female friends leaning their heads so close they are almost touching, sharing a whispered conversation. The shoulders are drawn inward, creating a private space. The focus is on their shared gaze and suppressed laughter, anime.",
        "exampleRealistic": "Concept art, intimate secret, close proximity: Two figures leaning their heads extremely close together, almost touching, sharing a whisper. The shoulders are drawn inward, creating a tight, private sphere. Focus on the slight forward tilt and concentration.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures with heads almost touching. Emphasize the strong, shared C-curve of the upper bodies leaning in for the secret, easy beginner prompt."
      },
      {
        "name": "Duduk Berdampingan (Back to Back)",
        "description": "Dua karakter duduk di tanah atau langkan, punggung bersentuhan, rileks.",
        "exampleAnime": "A scene of quiet anime companionship. Two figures sitting on the ground, leaning back against each other's shoulders or backs. The pose is relaxed and symmetrical, suggesting mutual support and rest. Legs are often extended outwards, anime.",
        "exampleRealistic": "Concept art, quiet companionship, mutual support: Two figures sitting on a high ledge, their backs lightly pressed together, staring out at a vast landscape. The posture is relaxed, vertical, and symmetrical, conveying deep, peaceful trust.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures sitting back-to-back. Use a straight, vertical line where the backs meet. Show the relaxed, open posture of the legs, easy beginner prompt."
      },
      {
        "name": "Menunjuk Bersama (Pointing Together)",
        "description": "Dua atau lebih karakter menunjuk ke arah yang sama, menunjukkan tujuan bersama.",
        "exampleAnime": "A dynamic group anime composition. Three characters standing shoulder-to-shoulder, all extending their right arms to point to a singular, unseen point in the distance. The three arms form parallel, converging lines, emphasizing shared focus and direction, anime.",
        "exampleRealistic": "Concept art, team focus, shared objective: A group of three explorers standing shoulder-to-shoulder, all extending their right arms in unison to point at an objective on the horizon. Focus on the parallel, converging lines of the arms, emphasizing unity of purpose.",
        "exampleAnatomy": "Black and white anatomical sketch. A group of figures pointing in the same direction. Highlight the strong, extended lines of the arms and the synchronized shoulder position, easy beginner prompt."
      },
      {
        "name": "Mengangkat dari Tanah (Lifting Off the Ground)",
        "description": "Satu karakter mengangkat yang lain sepenuhnya ke udara (misalnya, dalam perayaan).",
        "exampleAnime": "A moment of peak anime celebration. A strong figure lifting a lighter figure entirely off the ground in a spontaneous, joyous embrace. The lifted person's legs dangle freely, and their body is horizontal, demonstrating weightlessness from excitement, anime.",
        "exampleRealistic": "Concept art, explosive joy, zero gravity: A character being lifted entirely off the ground in a spontaneous, powerful hug. The lifted person's body is horizontal and completely buoyant, legs dangling. Focus on the pure joy and the lifter's powerful stance.",
        "exampleAnatomy": "Black and white anatomical sketch. One figure lifting another. Show the low center of gravity and wide stance of the lifter and the loose, horizontal body of the lifted person, easy beginner prompt."
      },
      {
        "name": "Mengajar/Membimbing (Teaching/Instructing)",
        "description": "Satu karakter menunjukkan sesuatu kepada yang lain (misalnya, memegang tangan mereka untuk memandu).",
        "exampleAnime": "A focused anime training scene. An older mentor standing close behind a student, guiding the student's hands on a tool (e.g., a sword hilt or brush). The mentor's body is dominant, and the student's body is receptive and focused on the hands, anime.",
        "exampleRealistic": "Concept art, focused training, mentor and student: An older master standing behind a student, their hands covering the student's hands on a crucial tool/weapon. The mentor's body is dominant, the student's is receptive. Focus on the precise, close contact of the hands.",
        "exampleAnatomy": "Black and white anatomical sketch. One figure guiding another's hands. Focus entirely on the close, precise contact point of the hands, showing the instructor's hand over the student's, easy beginner prompt."
      },
      {
        "name": "Berpegangan Tangan (Mengangkat) (Holding Hands - Lifting)",
        "description": "Satu karakter menarik yang lain dari tanah atau dari posisi jatuh.",
        "exampleAnime": "A high-tension anime scene. Two figures connected by only their hands. The pulling figure is low and leaning severely backward, maximizing counter-weight tension. The figure being pulled has their arm extended straight up. The diagonal line of tension is the key element, anime.",
        "exampleRealistic": "Concept art, cinematic tension, vertical pull: Two figures connected by a desperate, tight hand grip, one pulling the other up from a low point (e.g., over a cliff edge). The pulling figure is leaning sharply back, maximizing tension. Focus on the intense strain in the arms.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures connected by a hand grip, one pulling the other up. Emphasize the strong, diagonal line of tension between the two bodies, easy beginner prompt."
      },
      {
        "name": "Berkumpul/Rapat Tim (Group Huddle/Team Talk)",
        "description": "Tiga atau lebih karakter berkumpul, kepala berdekatan, lengan dirangkul di bahu.",
        "exampleAnime": "A motivational, close-knit anime composition. Five individuals in a tight circle, heads bowed low toward the center, hands/arms draped over each other's shoulders. The pose is closed and intimate, symbolizing unity and private discussion, anime.",
        "exampleRealistic": "Concept art, intimate team talk, focused inwards: Five armored warriors in a very tight circle, heads bowed low toward the center, arms draped over each other's shoulders. The pose is closed and serious, conveying a private, focused discussion.",
        "exampleAnatomy": "Black and white anatomical sketch. A group of figures in a tight huddle. Use overlapping shapes and lines to emphasize the inward curve of the heads and the close proximity, easy beginner prompt."
      },
      {
        "name": "Kontes Tatapan (Staring Contest)",
        "description": "Dua karakter berdiri sangat dekat, menatap mata lawan tanpa berkedip.",
        "exampleAnime": "A dramatic anime confrontation. Two characters standing perfectly still, close but not touching, with rigid, vertical bodies. The entire tension is focused on the intense, unblinking eye contact between them. Symmetric and highly charged, anime.",
        "exampleRealistic": "Concept art, psychic confrontation, rigid: Two powerful figures standing motionless, extremely close, engaged in an unblinking stare. The bodies are perfectly vertical and rigid, the tension focused entirely on the line of sight between the intense eyes.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures standing very close, perfectly vertical and rigid. Highlight the intense, unwavering line of sight between the two heads, easy beginner prompt."
      },
      {
        "name": "Sikap Bertarung Dua Orang (Two-Person Fight Stance)",
        "description": "Dua petarung dalam jarak dekat, lengan saling memblokir, menunjukkan ketegangan yang siap meledak.",
        "exampleAnime": "An illustration of pre-conflict anime tension. Two opponents in aggressive martial arts stances, circling each other. Arms are raised defensively, weight is low on the balls of their feet, and the bodies are highly coiled, showing immense potential energy, anime.",
        "exampleRealistic": "Concept art, high energy, pre-clash: Two martial artists in aggressive, coiled stances, arms raised defensively, circling each other in a dust-filled arena. The bodies are low, asymmetrical, and loaded with potential energy.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures facing each other in a low, aggressive stance. Use opposing diagonal lines for the bodies. Highlight the coiled, bent position of the legs, easy beginner prompt."
      },
      {
        "name": "Satu Berlutut (Asking)",
        "description": "Satu karakter berlutut di depan yang lain, seringkali untuk lamaran atau permintaan serius.",
        "exampleAnime": "A formal, submission anime pose. One figure is kneeling respectfully on one knee, head slightly bowed, while the other figure stands tall and dominant, looking down. The contrast in height and posture defines the power dynamic, anime.",
        "exampleRealistic": "Concept art, formal submission, hierarchy: One character kneeling formally on one knee, head slightly bowed in respect or supplication, facing a standing, dominant figure. The height difference emphasizes the power dynamic and seriousness of the request.",
        "exampleAnatomy": "Black and white anatomical sketch. One figure kneeling before a standing figure. Detail the strong vertical line of the standing person versus the low, bent knee and curved spine of the kneeling person, easy beginner prompt."
      },
      {
        "name": "Tangan di Bahu (Encouragement)",
        "description": "Satu karakter meletakkan tangan di bahu yang lain, menunjukkan dukungan atau kepemimpinan.",
        "exampleAnime": "A supportive, gentle anime interaction. One person standing slightly behind another, placing a hand firmly and reassuringly on their shoulder. The gesture is one of quiet leadership or empathy. The recipient's body is slightly slumped, the giver's is straight, anime.",
        "exampleRealistic": "Concept art, quiet leadership, support: A veteran mentor stands slightly behind a young protg, placing a firm, reassuring hand on their shoulder. The recipient is slightly slumped; the giver is straight. Focus on the weight and meaning conveyed by the hand contact.",
        "exampleAnatomy": "Black and white anatomical sketch. One figure placing a hand on another's shoulder. Highlight the weight/pressure point of the hand and the stable, vertical posture of the encouraging figure, easy beginner prompt."
      },
      {
        "name": "Berjalan Bergandengan Tangan (Walking Arm in Arm)",
        "description": "Dua karakter berjalan dengan lengan dikaitkan atau berpegangan di siku.",
        "exampleAnime": "A cheerful, synchronized anime movement scene. Two figures walking together, their arms linked casually at the elbow. Their legs and hips move in unison, creating a flowing, shared rhythm in their steps. The bodies are very close, anime.",
        "exampleRealistic": "Concept art, synchronized, mutual reliance: Two figures walking together, their arms linked tightly at the elbow. Their legs and hips move in a perfectly synchronized, flowing rhythm. Focus on the closeness and the shared, forward momentum.",
        "exampleAnatomy": "Black and white anatomical sketch. Two figures walking arm-in-arm. Use synchronized lines to show the shared rhythm of the legs and the close proximity of the upper torsos, easy beginner prompt."
      },
      {
        "name": "Bersandar pada Seseorang (Leaning on Someone)",
        "description": "Satu karakter bersandar pada yang lain karena kelelahan, mabuk, atau keintiman.",
        "exampleAnime": "A scene showing dependence. A person (the leaner) has completely relaxed their weight and is slumped heavily onto the shoulder and side of their companion (the supporter). The supporter's posture is rigid and stable, bearing the full, dead weight, anime.",
        "exampleRealistic": "Concept art, vulnerability, total weight: A figure (exhausted/injured) has completely slumped all their weight onto the shoulder of their companion (the supporter). The supporter stands rigid and straight, bearing the dead weight. Focus on the contrast between the limp vs. rigid bodies.",
        "exampleAnatomy": "Black and white anatomical sketch. One figure leaning heavily onto another. Use a strong vertical line for the supporter and a loose, heavy C-curve for the leaner. Highlight the weight distribution, easy beginner prompt."
      },
      {
        "name": "Sorakan Kelompok (Group Cheer)",
        "description": "Tiga atau lebih karakter dengan tangan di udara, berteriak kegirangan.",
        "exampleAnime": "A chaotic, jubilant anime scene. Multiple figures jumping randomly, all arms and hands flailing in the air, yelling in excitement. The movements are asymmetric and uncoordinated, conveying uncontrolled, overwhelming happiness, anime.",
        "exampleRealistic": "Concept art, chaotic joy, explosion of energy: A group of figures jumping, shouting, and flailing their arms randomly and enthusiastically into the air. The scene is a mix of uncoordinated, high-energy movement. Focus on the sheer volume of excited gestures.",
        "exampleAnatomy": "Black and white anatomical sketch. A chaotic group of figures with arms thrown up. Use many sharp, angular lines in different directions to show the uncontrolled, explosive energy, easy beginner prompt."
      },
      {
        "name": "Kagum (Admiration)",
        "description": "Satu karakter berlutut atau membungkuk di hadapan yang lain yang berdiri tegak.",
        "exampleAnime": "A high-contrast power scene. A figure standing tall and centered, while a supplicant kneels low on both knees before them, head bowed deeply. The extreme difference in vertical height emphasizes the hierarchy and reverence, anime.",
        "exampleRealistic": "Concept art, hierarchy, reverence: A supplicant kneels low on both knees and bows deeply before a figure standing tall and centered on a pedestal. The extreme contrast in verticality emphasizes the power and the act of submission.",
        "exampleAnatomy": "Black and white anatomical sketch. One figure kneeling low before a standing figure. Emphasize the downward curve of the supplicant's spine and the vertical, dominant line of the admired figure. Focus on simple, clear silhouettes, easy beginner prompt."
      }
    ]
  }
]

