[
  {
    "id": "style_5_fashion",
    "name": "5. POSE FASHION & ESTETIKA",
    "accentColor": "#FF69B4",
    "icon": "fas fa-crown",
    "definition": [
      "Pose yang kaku, berlebihan, atau tidak alami, dirancang untuk menonjolkan pakaian atau siluet.",
      "Mengutamakan garis tubuh yang tajam, keseimbangan yang tidak konvensional, dan ekspresi yang dingin atau dramatis.",
      "Sering digunakan dalam fotografi editorial, *catwalk*, dan ilustrasi mode."
    ],
    "subpose": [
      {
        "name": "The High-Fashion Arch",
        "description": "Berdiri tegak dengan punggung dilengkungkan ke belakang secara berlebihan, kepala miring, menciptakan garis busur 'C' yang ekstrem.",
        "exampleAnime": "High-fashion anime illustration, digital watercolor style. A glamorous figure standing with an exaggerated back arch, emphasizing the flow of an expensive, sweeping gown. Expression is bored and intense. Use soft, diffused lighting and complex fabric shading, anime, high-fashion.",
        "exampleRealistic": "Concept art, dramatic studio shoot: A model standing with an extreme back arch, hands held delicately at the waist. Focus on the sharp shadow play and the unnatural elegance of the pose."
      },
      {
        "name": "The Broken Doll",
        "description": "Pose dengan anggota tubuh kaku dan tertekuk pada sudut yang aneh (mirip manekin yang rusak), seringkali duduk atau setengah berbaring.",
        "exampleAnime": "Gothic fashion anime illustration, dark theme. A beautiful but lifeless-looking character sitting on a velvet chair, limbs positioned at disjointed, sharp angles, head tilted unnaturally. Deep shadows and detailed lace texture, anime, dark aesthetic.",
        "exampleRealistic": "Concept art, surreal photography: A figure seated on the floor, one knee bent extremely high, the other leg straight, arms hanging limply. Focus on the glossy skin texture and blank expression."
      },
      {
        "name": "The Finger-Point Stare",
        "description": "Pose close-up wajah di mana karakter menunjuk ke mata mereka sendiri dengan jari telunjuk (satu atau kedua) sambil menatap tajam.",
        "exampleAnime": "Close-up anime portrait, intense gaze, shojo style. A character is pointing a finger precisely at the corner of their own eye or tear duct, maintaining severe eye contact with the viewer. Use striking color contrast and high detail on the eyes, anime.",
        "exampleRealistic": "Concept art, beauty shot: A model pointing a delicate finger to the outer corner of their eye. Focus on the makeup detail and the sharp contrast of the finger against the skin."
      },
      {
        "name": "The Asymmetrical Lean",
        "description": "Seluruh berat badan dipindahkan ke satu sisi, kepala dan pinggul miring ke arah yang berlawanan, menciptakan asimetri total.",
        "exampleAnime": "Street fashion anime illustration, low-key lighting. A cool character leaning heavily against an invisible support, one shoulder drastically lower than the other. Slouchy posture but intense expression, anime, detailed urban background.",
        "exampleRealistic": "Concept art, fashion editorial: A model in oversized clothing leaning to one side, creating voluminous folds in the fabric. Focus on the texture and volume of the attire."
      },
      {
        "name": "The Floating Walk",
        "description": "Pose saat berjalan dengan langkah memanjang, pinggul diayunkan tinggi, membuat kaki terlihat sangat panjang dan ringan.",
        "exampleAnime": "Runway anime illustration, dynamic motion. A character walking with an exaggeratedly long stride, one leg straight and the other lifting high, creating a 'floating' illusion. Focus on the movement of the coat/skirt hems, anime, bright lights.",
        "exampleRealistic": "Concept art, *catwalk* simulation: A model mid-stride, captured where both feet are momentarily off the ground. Focus on the elegant extension of the limbs."
      },
      {
        "name": "Hands-on-Head (Stres Estetika)",
        "description": "Karakter memegang kedua tangan di atas kepala atau menekan pelipis dengan telapak tangan, seringkali dengan ekspresi kesakitan yang tenang.",
        "exampleAnime": "Aesthetic anime illustration, emotional intensity. A character pressing their palms gently to their temples, eyes closed, conveying quiet drama or headache. Soft, dramatic side lighting, anime.",
        "exampleRealistic": "Concept art, stylized emotion: A figure seated, leaning forward, hands pressed against the sides of the head. Focus on the delicate tension in the neck and arms."
      },
      {
        "name": "The 'Vogue' Face",
        "description": "Close-up wajah yang kaku dan tanpa emosi, mata sedikit terangkat, garis rahang tajam.",
        "exampleAnime": "Hyper-realistic anime portrait, striking makeup. Close-up on the face with a perfectly blank, aloof expression, looking slightly up and past the viewer. Sharp cel shading on the cheekbones, anime, high detail.",
        "exampleRealistic": "Concept art, magazine cover quality: Extreme close-up on a face with immaculate skin, lips slightly parted, a cold and detached expression. Focus on the flawless detail."
      },
      {
        "name": "Kaki Silang (The Crossed Leg)",
        "description": "Berdiri dengan kaki bersilang rapat, seringkali diimbangi dengan pinggul miring dan tangan di pinggul.",
        "exampleAnime": "Shoujo fashion anime illustration, cute and confident. A female character standing with legs tightly crossed, one hand sassily placed on her hip, smiling mischievously. Bright, bubbly colors, anime.",
        "exampleRealistic": "Concept art, casual street style: A person standing at a traffic light with legs crossed at the mid-calf, leaning slightly back. Focus on the balanced, casual stance."
      },
      {
        "name": "The Tilted Shoulder",
        "description": "Satu bahu dinaikkan tinggi dan bahu yang lain diturunkan, menciptakan ketegangan leher yang dramatis.",
        "exampleAnime": "Elegant anime illustration, serious mood. A tall character standing with one shoulder raised dramatically, head slightly tucked in, giving a severe, powerful look. Use sharp shadows and strong vertical lines, anime.",
        "exampleRealistic": "Concept art, intense portrait: A figure looking over a dramatically raised shoulder. Focus on the shadows cast by the collarbone and neck tension."
      },
      {
        "name": "The Cape Sweep",
        "description": "Pose dinamis di mana karakter sedang memutar, menyebabkan jubah atau gaun panjang mereka menyapu di sekelilingnya.",
        "exampleAnime": "Epic fantasy anime illustration, action pose. A powerful character captured mid-spin, their long, luxurious cape swirling dramatically around their body in a perfect circle. Use flowing movement lines and high contrast lighting, anime.",
        "exampleRealistic": "Concept art, cinematic movement: A figure in a heavy, flowing coat captured in a fast spin. Focus on the wind and fabric dynamics."
      },
      {
        "name": "Membelakangi Kamera (Over the Shoulder)",
        "description": "Karakter membelakangi penonton, tetapi menoleh ke belakang untuk melihat melewati bahu.",
        "exampleAnime": "Manga panel style, mysterious character. A figure with a long coat standing with their back to the viewer, turning only their head to look back over their shoulder with a piercing gaze. Heavy shadows and silhouette focus, anime/manga.",
        "exampleRealistic": "Concept art, film noir: A woman standing in a smoky alley, looking back over her bare shoulder with a seductive, dangerous look. Focus on the sharp shadow texture."
      },
      {
        "name": "The High-Knee Step",
        "description": "Berjalan atau melangkah dengan satu lutut diangkat sangat tinggi, seringkali di depan tubuh.",
        "exampleAnime": "Dynamic fashion anime illustration. A confident character taking a large, exaggerated step with one knee raised almost to chest level. Use clean, dynamic lines and bold colors, anime.",
        "exampleRealistic": "Concept art, theatrical movement: A model marching with a high-stepping gait, emphasizing the shape of the leg muscles."
      },
      {
        "name": "The Lean Back",
        "description": "Karakter bersandar ke belakang seolah-olah ditarik oleh kekuatan tak terlihat, tetapi tetap seimbang di ujung kaki.",
        "exampleAnime": "Avant-garde anime illustration. A character standing almost falling backward, defying gravity, held in perfect tension. Body forming a long, elegant line. Use minimalist background and sharp focus, anime.",
        "exampleRealistic": "Concept art, contemporary dance: A dancer holding an impossible lean backward, balanced perfectly on one heel. Focus on the core strength and tension."
      },
      {
        "name": "The Hand Rest (di Lutut)",
        "description": "Karakter duduk dan meletakkan kedua tangan atau satu tangan dengan anggun di atas lutut yang tertekuk.",
        "exampleAnime": "Elegant shojo anime illustration, refined atmosphere. A female character sitting in a chair, one knee slightly raised, one hand resting gently on top of the knee. Posture is graceful and controlled, anime.",
        "exampleRealistic": "Concept art, formal portrait: A figure sitting on a velvet ottoman, hands clasped neatly and resting on one raised knee. Focus on the intricate fabric detail."
      },
      {
        "name": "Tangan Menutupi Separuh Wajah",
        "description": "Satu tangan menutupi separuh wajah (mata atau mulut) untuk menambah misteri atau drama.",
        "exampleAnime": "Dark fantasy anime illustration, mysterious figure. A character's face is half-covered by a pale hand, only one eye visible and staring out intensely from the shadow. Use heavy, moody cross-hatching, anime/manga.",
        "exampleRealistic": "Concept art, hidden identity: A figure wearing a wide-brimmed hat, one hand covering the nose and mouth, leaving only the eyes visible. Focus on the texture of the gloves."
      },
      {
        "name": "The Hip Pop",
        "description": "Berdiri dengan kaki lurus, tetapi pinggul didorong keras ke satu sisi, menciptakan lekukan pada pinggang.",
        "exampleAnime": "Confident model anime illustration. A character standing with a sassy 'hip pop' motion, one hand on the waist, a challenging smirk. Use exaggerated body lines and pop colors, anime.",
        "exampleRealistic": "Concept art, confident portrait: A person standing with the weight shifted entirely to one side, causing a strong outward curve of the hip. Focus on the sharpness of the pose."
      },
      {
        "name": "Melihat ke Bawah (Eksistensial)",
        "description": "Kepala dimiringkan ke bawah, pandangan mata mengarah ke tanah atau sepatu, conveying kesedihan yang estetik.",
        "exampleAnime": "Melancholic anime illustration, rain effects. A character standing under an awning, head deeply bowed, gazing at the reflections on the wet street. Use cold, diffused lighting, shojo style anime.",
        "exampleRealistic": "Concept art, emotional isolation: A figure standing alone on a long dock, looking down at their feet and the dark water below. Focus on the lonely posture."
      },
      {
        "name": "The Power Squat",
        "description": "Karakter berjongkok rendah dengan punggung tegak, lutut ditekuk tajam, seringkali memegang senjata di depan.",
        "exampleAnime": "Dynamic sci-fi anime illustration. A cyberpunk warrior in a low, powerful squat, balanced perfectly on the balls of their feet, holding a laser rifle aimed forward. Use neon reflections and sharp metal textures, anime.",
        "exampleRealistic": "Concept art, tactical surveillance: A soldier crouched low behind a rocky cover, waiting patiently. Focus on the stability of the low center of gravity."
      },
      {
        "name": "The 'T'-Pose (Minimalis)",
        "description": "Berdiri tegak lurus dengan lengan direntangkan lurus ke samping, mirip dengan pose default model 3D.",
        "exampleAnime": "Minimalist aesthetic anime illustration. A character standing perfectly still in a 'T' pose in the center of an empty, vast white room. Focus on the clean lines and the stark simplicity, anime, minimalist art.",
        "exampleRealistic": "Concept art, surreal art: A figure standing motionless in a void, arms extended perfectly horizontal. Focus on the absolute stillness and symmetry."
      },
      {
        "name": "Tangan di Leher Depan",
        "description": "Satu atau kedua tangan diletakkan di depan leher atau tenggorokan dalam posisi tertutup, menunjukkan kerentanan atau ketegangan.",
        "exampleAnime": "Emotional anime illustration. A character standing, hands gently clasped over the front of their neck, eyes wide and vulnerable. Soft, trembling line art, anime, shojo style.",
        "exampleRealistic": "Concept art, subtle fear: A person sitting stiffly, one hand unconsciously gripping the base of their throat. Focus on the nervous energy."
      },
      {
        "name": "The Head-Rest Arm",
        "description": "Berdiri atau duduk, satu lengan diletakkan melintang di atas kepala, bertumpu pada lengan yang lain atau bahu.",
        "exampleAnime": "Casual slice of life anime illustration. A character sitting back lazily, one arm bent and draped across the top of their head, relaxed expression. Warm sunlight, anime.",
        "exampleRealistic": "Concept art, relaxed pose: A figure lounging on a patio chair, one arm draped over the back of their head, enjoying the sun. Focus on the easy lines of the body."
      },
      {
        "name": "Berputar Melompat (Graceful)",
        "description": "Karakter melompat dan berputar di udara dengan kaki terentang, seperti balerina.",
        "exampleAnime": "Ballet inspired anime illustration. A graceful female figure captured mid-air during a full pirouette jump, legs extended beautifully, eyes closed in concentration. Use ethereal light and flowing ribbon effects, anime, high detail.",
        "exampleRealistic": "Concept art, dynamic dance: A ballerina in a full jeté, spinning rapidly. Focus on the extended lines of the body and the blurring background."
      },
      {
        "name": "The Hidden Hand",
        "description": "Karakter berdiri, satu tangan tersembunyi sepenuhnya di belakang punggung, menciptakan asimetri yang mengundang rasa ingin tahu.",
        "exampleAnime": "Mysterious anime illustration, detective style. A character standing with one hand casually visible, the other hand completely hidden behind their back, suggesting a hidden weapon or secret. Use sharp focus and shadow contrast, anime.",
        "exampleRealistic": "Concept art, silent negotiation: A figure standing calmly, one hand visible on the table, the other hand behind the back. Focus on the contrast between the relaxed and hidden arm."
      },
      {
        "name": "Jempol ke Atas (Sarcastic)",
        "description": "Karakter memberikan tanda jempol ke atas (*thumbs up*), tetapi dengan ekspresi wajah yang muram atau sarkastik.",
        "exampleAnime": "Comedic anime illustration, dry humor. A character giving a forced, slightly manic thumbs-up sign, their face displaying a clear, tired, or sarcastic smile. Use minimalist shading and focus on the eyes, anime.",
        "exampleRealistic": "Concept art, dry wit: A person giving a lukewarm thumbs-up, their face clearly showing disinterest or forced enthusiasm. Focus on the subtle tension in the smile."
      },
      {
        "name": "The High-Fashion Squat",
        "description": "Berjongkok dengan posisi yang sangat rendah, seringkali dengan wajah menghadap ke depan dan lengan menggantung bebas.",
        "exampleAnime": "Avant-garde anime illustration, dramatic perspective. A character is in a very low, almost full squat, looking up at the viewer with an intense, unblinking gaze. Use sharp angular body lines and high detail clothing, anime, fashion style.",
        "exampleRealistic": "Concept art, urban exploration: A figure squatting low on a mossy, uneven ledge, maintaining intense eye contact. Focus on the textures of the surroundings."
      }
    ]
  },
  {
    "id": "style_6_meditasi",
    "name": "6. POSE MEDITASI & SPIRITUAL",
    "accentColor": "#6A5ACD",
    "icon": "fas fa-leaf",
    "definition": [
      "Pose yang berfokus pada ketenangan, keseimbangan internal, dan koneksi spiritual atau energi.",
      "Ciri khasnya adalah simetri, *mudra* (isyarat tangan simbolis), dan postur yang stabil.",
      "Digunakan untuk menggambarkan kebijaksanaan, ketenangan, atau kekuatan batin."
    ],
    "subpose": [
      {
        "name": "Lotus Penuh (Padmasana)",
        "description": "Duduk bersila dengan kedua kaki di atas paha yang berlawanan, punggung tegak sempurna.",
        "exampleAnime": "Fantasy anime illustration, spiritual power. A sage sitting in a perfect full lotus pose (Padmasana) on a floating rock, glowing with soft, blue internal energy. Use calm, symmetrical composition and flowing robes, anime, detailed nature background.",
        "exampleRealistic": "Concept art, tranquil setting: A figure meditating in the full lotus pose on a stone platform, surrounded by calm water. Focus on the deep serenity and perfect vertical alignment."
      },
      {
        "name": "Mudra Jhana",
        "description": "Tangan diletakkan di pangkuan, telapak tangan menghadap ke atas, ibu jari saling bersentuhan, membentuk segitiga.",
        "exampleAnime": "Zen anime illustration, high detail. Close-up on the hands of a meditating character, perfectly forming the Dhyana Mudra. Subtle light emanating from the center of the hands. Use clean, focused lighting and delicate line art, anime.",
        "exampleRealistic": "Concept art, high contrast light: Close-up on hands forming the Jhana Mudra, lit by a single candle flame. Focus on the delicate bone structure and skin texture."
      },
      {
        "name": "Mudra Gyan (Kebijaksanaan)",
        "description": "Duduk bersila, jari telunjuk menyentuh ibu jari (lingkaran) di setiap lutut, telapak tangan menghadap ke atas.",
        "exampleAnime": "Fantasy anime illustration, ancient temple setting. A wise monk sitting in a simple cross-legged pose, hands resting on knees, forming the Gyan Mudra. Use soft, ambient light and deep, meditative expression, anime.",
        "exampleRealistic": "Concept art, wisdom: A figure sitting under a massive ancient tree, hands resting on knees with the Gyan Mudra. Focus on the peaceful stillness."
      },
      {
        "name": "The Vertical Float",
        "description": "Karakter melayang vertikal di udara dengan kaki menggantung santai, punggung tegak, menunjukkan kontrol energi.",
        "exampleAnime": "Sci-fi/Fantasy anime illustration. A character hovering effortlessly a few feet off the ground, eyes closed, body perfectly vertical and relaxed. Subtle ripple effect of surrounding energy, anime.",
        "exampleRealistic": "Concept art, zero gravity training: An astronaut floating vertically in a chamber, completely relaxed, demonstrating mastery over their movement. Focus on the weightlessness."
      },
      {
        "name": "Puja (Berdoa)",
        "description": "Berlutut dengan punggung lurus, tangan diangkat ke atas dengan telapak tangan terbuka ke arah langit.",
        "exampleAnime": "Spiritual anime illustration, sunrise scene. A character kneeling on a rooftop, both hands raised high above the head, palms open to the rising sun in a gesture of prayer or offering. Use warm, golden hour lighting, anime.",
        "exampleRealistic": "Concept art, religious ritual: A figure kneeling on rugged ground, head tilted back, hands lifted and open to the sky. Focus on the rough textures and the light source."
      },
      {
        "name": "Savasana (Mayat)",
        "description": "Berbaring telentang sepenuhnya, anggota badan terentang dan santai, mata tertutup.",
        "exampleAnime": "Tranquil slice of life anime illustration, indoor light. A character lying perfectly still on a yoga mat or floor, limbs slightly spread, fully relaxed. The scene is calm and simple, anime.",
        "exampleRealistic": "Concept art, deep relaxation: A person lying flat on their back, completely still, focusing on the subtle movement of breathing. Focus on the absolute lack of tension."
      },
      {
        "name": "Membuka Energi (Tangan Terentang)",
        "description": "Berdiri dengan kaki terpisah, kedua tangan direntangkan ke samping dan sedikit ke depan, telapak tangan menghadap ke depan.",
        "exampleAnime": "Shonen anime power scene, energy channeling. A character standing with arms extended slightly forward and out, palms open, visibly absorbing or emitting a huge sphere of crackling energy. Use vibrant blue/green glow effects, anime.",
        "exampleRealistic": "Concept art, channeling power: A figure standing on a desolate plain, arms wide, seeming to summon a storm. Focus on the intensity of the gesture."
      },
      {
        "name": "Pose Pohon (Vrksasana)",
        "description": "Berdiri tegak di satu kaki, kaki yang lain ditekuk dan diletakkan di paha bagian dalam, tangan di *anjali mudra* (doa).",
        "exampleAnime": "Yoga anime illustration, nature setting. A character in a perfect Tree Pose (Vrksasana) on a forest path, hands pressed together in prayer at the chest. Use soft, dappled light and focus on balance, anime.",
        "exampleRealistic": "Concept art, perfect balance: A figure standing in Vrksasana on a narrow cliff edge. Focus on the tension required to maintain stillness."
      },
      {
        "name": "Bow of Respect (Busur Hormat)",
        "description": "Membungkuk dalam-dalam dari pinggang, tangan lurus di samping atau di depan.",
        "exampleAnime": "Traditional Japanese anime illustration. A character performing a deep, respectful bow (Ojigi), bending 90 degrees at the waist, hands straight at the sides. Clean, minimalist lines, anime.",
        "exampleRealistic": "Concept art, formal greeting: A person in formal wear executing a perfect, deep bow to show reverence. Focus on the precise angle of the bend."
      },
      {
        "name": "Meditasi Berjalan (Kin-hin)",
        "description": "Berjalan sangat lambat, fokus pada setiap langkah, mata tertunduk sedikit.",
        "exampleAnime": "Zen anime illustration, temple garden. A character walking with deliberate slowness on a gravel path, hands loosely clasped behind their back, deep in concentration. Soft, diffused lighting, anime.",
        "exampleRealistic": "Concept art, mindful movement: A figure walking barefoot on grass, body perfectly upright, focusing intensely on the sensation of their feet touching the ground."
      },
      {
        "name": "Penyeimbangan Lengan di Tanah (Bakasana)",
        "description": "Berjongkok rendah, tubuh seimbang di atas lengan yang ditekuk, kaki melayang di udara.",
        "exampleAnime": "Dynamic yoga anime illustration. A strong character holding a perfect Crow Pose (Bakasana), balanced entirely on their arms, looking forward calmly. Use sharp angular lines and a clean background, anime.",
        "exampleRealistic": "Concept art, immense strength: A figure balancing in Bakasana, emphasizing the compression of the core and the strength of the triceps."
      },
      {
        "name": "Mudra Vitarka (Mengajar)",
        "description": "Jari telunjuk dan ibu jari membentuk lingkaran (seperti 'oke'), tangan diangkat di depan bahu, telapak tangan menghadap ke luar.",
        "exampleAnime": "Teacher anime illustration, intellectual setting. A charismatic teacher standing, making the Vitarka Mudra with one hand while explaining a complex concept. Focused, confident expression, anime.",
        "exampleRealistic": "Concept art, philosophical debate: A figure gesturing with the Vitarka Mudra during a calm explanation. Focus on the clarity of the gesture."
      },
      {
        "name": "Salamba Sirsasana (Headstand)",
        "description": "Berdiri terbalik dengan kepala di tanah dan lengan membentuk penyangga, kaki lurus ke atas.",
        "exampleAnime": "Intense yoga anime illustration. A flexible character holding a perfect supported headstand (Salamba Sirsasana) in an empty, sunny studio. Focus on the perfect vertical line of the body, anime.",
        "exampleRealistic": "Concept art, gravity defiance: A figure holding a stable headstand on a rocky surface, showing complete control and core engagement."
      },
      {
        "name": "Mantra Chanting (Tangan Menangkup)",
        "description": "Duduk, tangan menangkup di depan mulut, seperti sedang melantunkan mantra atau bersenandung.",
        "exampleAnime": "Spiritual anime illustration, dim lighting. A character sitting quietly, hands cupped tightly in front of their mouth, eyes closed, seemingly chanting a mantra. Subtle sound wave effect (implied), anime.",
        "exampleRealistic": "Concept art, serene moment: A figure sitting in a quiet, dark church, hands cupped to their mouth, softly humming a tune. Focus on the gentle curve of the hands."
      },
      {
        "name": "Duduk Mengambang (Half Lotus)",
        "description": "Duduk bersila dengan satu kaki di atas paha yang berlawanan (*ardha padmasana*), tubuh sedikit miring.",
        "exampleAnime": "Casual fantasy anime illustration. A character sitting in the half-lotus pose on the edge of a pond, relaxed but thoughtful. Focus on the asymmetrical comfort, anime, detailed nature.",
        "exampleRealistic": "Concept art, outdoor study: A person sitting in the half-lotus pose on a smooth, flat rock by a stream, writing in a small notebook. Focus on the slight tilt of the posture."
      },
      {
        "name": "Penyerahan Diri (Lengan Terentang ke Bawah)",
        "description": "Berdiri, lengan menjuntai ke samping, telapak tangan menghadap ke belakang atau ke luar, menunjukkan kerentanan total.",
        "exampleAnime": "Emotional anime illustration, moment of truth. A character standing still, arms loose at their sides, palms open to the sky or viewer, an expression of total emotional surrender. Use exposed, soft lighting, anime.",
        "exampleRealistic": "Concept art, confrontation: A figure standing absolutely still in an open field, arms hanging loosely, accepting their fate. Focus on the exposed, vulnerable pose."
      },
      {
        "name": "Melindungi Aura (Tangan di Sekitar Tubuh)",
        "description": "Berdiri, lengan dilingkarkan di sekitar tubuh, tidak memeluk tetapi menjaga jarak tertentu, melindungi 'aura' atau energi.",
        "exampleAnime": "Mystical anime illustration. A character standing in a defensive meditative stance, hands held a foot away from the body, palms inward, creating a glowing shield of energy around them. Use strong glow effects, anime.",
        "exampleRealistic": "Concept art, energy practice: A figure standing with arms circling their own body at a distance, performing a Qigong movement. Focus on the concentration and slow motion (implied)."
      },
      {
        "name": "Menarik Napas Dalam (Tangan di Perut)",
        "description": "Berdiri atau duduk, kedua tangan diletakkan di perut bagian bawah (*dantian*), mata tertutup, fokus pada pernapasan.",
        "exampleAnime": "Zen moment anime illustration. A character sitting calmly, both hands resting gently on their lower abdomen, eyes closed, expressing deep, controlled breathing. Peaceful expression, anime.",
        "exampleRealistic": "Concept art, breathing exercise: A person standing by a sea shore, hands resting lightly on their stomach, taking a deep, mindful breath. Focus on the quiet movement of the chest."
      },
      {
        "name": "Mudra Prithvi (Bumi)",
        "description": "Jari manis menyentuh ibu jari di setiap tangan, isyarat untuk stabilitas dan hubungan dengan Bumi.",
        "exampleAnime": "Earth-element fantasy anime illustration. A character standing barefoot on a grassy hill, hands forming the Prithvi Mudra, connected to the earth. Green energy effects, anime.",
        "exampleRealistic": "Concept art, grounded feeling: A figure sitting on a patch of dirt, hands resting on the ground, forming the Prithvi Mudra. Focus on the tactile connection to the soil."
      },
      {
        "name": "Terbangun dari Meditasi",
        "description": "Karakter tetap di posisinya (bersila) tetapi perlahan membuka mata, melihat sekeliling dengan tenang.",
        "exampleAnime": "Transitional anime illustration. A character sitting in a meditative pose, just opening their eyes, the world coming back into soft focus. Expression is calm and newly aware, anime.",
        "exampleRealistic": "Concept art, moment of awakening: A figure in a quiet room, slowly opening their eyes after a long meditation, the light softly hitting their face. Focus on the transition from internal to external awareness."
      },
      {
        "name": "Menghormati Guru (Anjali Mudra)",
        "description": "Berdiri tegak, kedua telapak tangan disatukan di depan dada (isyarat doa), dagu sedikit ditundukkan.",
        "exampleAnime": "Formal anime illustration, temple setting. A respectful student standing in Anjali Mudra, facing their master. Posture is humble and perfectly straight, anime.",
        "exampleRealistic": "Concept art, cultural greeting: A person standing in a quiet room, performing a formal 'Namaste' gesture with deep respect. Focus on the perfect alignment of the hands."
      },
      {
        "name": "Viparita Karani (Legs-up-the-Wall)",
        "description": "Berbaring telentang, kaki diangkat lurus ke atas, bersandar di dinding atau di udara.",
        "exampleAnime": "Relaxing anime illustration. A character lying on the floor, their legs resting casually straight up against a wall, reading a book in that inverted pose. Casual, gentle lighting, anime.",
        "exampleRealistic": "Concept art, restorative yoga: A figure with their legs resting vertically up a white wall, arms relaxed by their sides. Focus on the restful stillness."
      },
      {
        "name": "Sun Salutation (Urdhva Hastasana)",
        "description": "Berdiri tegak, kedua lengan direntangkan lurus ke atas, telapak tangan saling berhadapan, punggung sedikit melengkung.",
        "exampleAnime": "Energetic yoga anime illustration, outdoor scene. A character standing tall, reaching their arms up and back to salute the sun. Dynamic lighting from the sun rays, anime.",
        "exampleRealistic": "Concept art, morning routine: A person standing on a hillside at sunrise, performing a deep backbend with arms extended, welcoming the light. Focus on the stretch and opening of the chest."
      },
      {
        "name": "The Seiza Kneel",
        "description": "Duduk dengan lutut ditekuk, bersandar pada tumit, punggung tegak, tangan di pangkuan.",
        "exampleAnime": "Traditional Japanese anime illustration. A character sitting politely in the Seiza position on a tatami mat, hands resting neatly on their thighs, very formal and stable posture. Clean lines, anime.",
        "exampleRealistic": "Concept art, solemnity: A figure kneeling in Seiza in a quiet room. Focus on the perfect verticality and stillness required for the pose."
      },
      {
        "name": "Mudra Apana (Detoks)",
        "description": "Jari tengah dan jari manis menyentuh ibu jari di setiap tangan, isyarat untuk melepaskan energi.",
        "exampleAnime": "Fantasy anime illustration, energy manipulation. A character standing with hands forming the Apana Mudra, hands held out, releasing dark, swirling energy into the ground. Strong graphic effect, anime.",
        "exampleRealistic": "Concept art, focused healing: A figure sitting, intensely concentrating while holding the Apana Mudra. Focus on the controlled tension in the hands."
      }
    ]
  },
  {
    "id": "style_7_horror",
    "name": "7. POSE HOROR & KETAKUTAN",
    "accentColor": "#8B0000",
    "icon": "fas fa-skull-crossbones",
    "definition": [
      "Pose yang dirancang untuk membangkitkan kengerian, kejanggalan, atau rasa tidak nyaman (uncanny valley).",
      "Menggunakan distorsi tubuh, bayangan dramatis, dan gerakan yang patah-patah atau sangat lambat (slow-burn).",
      "Fokus pada disonansi antara tubuh yang seharusnya normal dan posisi yang tidak wajar."
    ],
    "subpose": [
      {
        "name": "The Spider Crawl",
        "description": "Berjalan atau merangkak dengan punggung melengkung ke belakang (*bridge*), tetapi kepala dan kaki bergerak maju.",
        "exampleAnime": "Horror anime illustration, dark lighting. A female figure crawling on all fours, but the body is unnaturally inverted in a terrifying 'spider walk' position. Limbs are long and skinny. Use extreme shadows and high, eerie reflections in the eyes, anime, horror style.",
        "exampleRealistic": "Concept art, found footage horror: A figure in a dark hallway performing a disturbing, contorted crawl. Focus on the unnatural strain on the joints and spine."
      },
      {
        "name": "The Broken Neck Tilt",
        "description": "Kepala dimiringkan ke samping secara berlebihan (lebih dari 45 derajat) dengan senyum yang tidak wajar.",
        "exampleAnime": "Psychological horror anime illustration. A character standing in an empty room, head tilted extremely to one side as if the neck is broken, but with a wide, unnerving smile. Use muted colors and an unsettling symmetrical composition, anime, horror style.",
        "exampleRealistic": "Concept art, unsettling character: A figure staring directly at the viewer, head tilted past a natural angle. Focus on the eerie stillness of the pose combined with the smile."
      },
      {
        "name": "Menghadap Dinding (Isolation)",
        "description": "Karakter berdiri atau duduk menghadap dinding, membelakangi penonton, seringkali kaku dan diam.",
        "exampleAnime": "Mystery anime illustration, abandoned school setting. A small figure standing motionless in the corner of a dark room, facing the wall, hands hanging limply. Deep, suffocating shadow, anime.",
        "exampleRealistic": "Concept art, psychological dread: A person standing rigidly in a barren room, facing the corner. Focus on the vulnerability of the exposed back and the stillness."
      },
      {
        "name": "The Lurk (Mengintai)",
        "description": "Jongkok rendah di tempat yang gelap, hanya kepala dan mata yang mengintip ke atas.",
        "exampleAnime": "Survival horror anime illustration. A menacing figure crouched low behind a barrel or obstacle, only their gleaming, wide eyes visible over the top, intensely watching the viewer. Use extreme low light and sharp eye highlights, anime.",
        "exampleRealistic": "Concept art, stalking scene: A figure hidden in dense brush, crouched low, peering out from the shadows with intense focus. Focus on the predatory posture."
      },
      {
        "name": "The Hanging Head",
        "description": "Kepala karakter digantung longgar ke bawah atau ke samping seolah-olah lehernya tidak memiliki tulang.",
        "exampleAnime": "Gothic horror anime illustration. A tall, pale figure standing stiffly, but the head is completely lolled to one side, hair obscuring the face, suggesting an unnatural state. Use monochrome palette and stark vertical lines, anime.",
        "exampleRealistic": "Concept art, possession: A figure slumped in a chair, neck completely relaxed so the head hangs forward and down, completely lifeless. Focus on the gravity and relaxation of death."
      },
      {
        "name": "Menjauh (Crawling Away)",
        "description": "Karakter merangkak mundur atau merayap menjauh dari penonton, menunjukkan ketakutan ekstrem.",
        "exampleAnime": "Found footage anime illustration. A character desperately scrambling backward on the ground, away from an unseen horror, face contorted in sheer terror. Use rough, shaky line art and deep lens distortion, anime.",
        "exampleRealistic": "Concept art, visceral fear: A person on the ground, using their arms to push themselves backward rapidly, body low and panicked. Focus on the desperate scramble."
      },
      {
        "name": "The Wide Stare",
        "description": "Close-up mata yang terbuka lebar, bola mata terlihat di bawah dan di atas iris, tanpa berkedip.",
        "exampleAnime": "Extreme horror anime portrait. Close-up on the eyes, wide open in sheer terror or madness, showing the white sclera around the entire iris (Sanpaku eyes). Use jagged lighting and venous detail, anime, horror style.",
        "exampleRealistic": "Concept art, manic intensity: A face with eyes wide open and unblinking, veins slightly bulging. Focus on the reflective, intense wetness of the eyes."
      },
      {
        "name": "The Unseen Force",
        "description": "Karakter melayang atau terlempar ke udara, anggota tubuhnya ditekuk secara tidak wajar seolah-olah dikendalikan oleh kekuatan tak terlihat.",
        "exampleAnime": "Demonic horror anime illustration. A character suspended mid-air, back arched unnaturally, one arm extended as if being choked by an invisible hand. Use heavy dark shadows and sharp body angles, anime.",
        "exampleRealistic": "Concept art, telekinetic attack: A figure thrown violently against a wall, limbs splayed and twisted at impossible angles by an unseen force. Focus on the impact distortion."
      },
      {
        "name": "Bersembunyi di Bawah Selimut",
        "description": "Karakter meringkuk di tempat tidur, hanya sebagian kecil mata atau dahi yang mengintip dari balik selimut.",
        "exampleAnime": "Childhood terror anime illustration. A character hiding completely under a huge duvet, only a terrified eye peeking out from a small gap. Use deep, contrasting shadows around the bed, anime.",
        "exampleRealistic": "Concept art, intimate fear: A person huddled under heavy blankets, only a sliver of their anxious face visible. Focus on the texture of the thick fabric."
      },
      {
        "name": "The Pacing Shadow",
        "description": "Karakter berjalan mondar-mandir dalam gerakan kaku, kepala menunduk, tangan terkepal di belakang punggung.",
        "exampleAnime": "Suspense anime illustration. A dark, silhouetted figure pacing slowly and deliberately in a small, empty room, head bowed in deep, troubling thought. Use minimalist lighting and repetitive action (implied), anime.",
        "exampleRealistic": "Concept art, nervous tension: A figure pacing back and forth in a prison cell, hands clasped tightly behind the back. Focus on the nervous energy of the movement."
      },
      {
        "name": "The Silent Scream",
        "description": "Mulut terbuka lebar dalam jeritan, tetapi tangan menutupi mulut dengan paksa, menahan suara.",
        "exampleAnime": "Extreme emotional horror anime illustration. A close-up on a face screaming silently, one hand pressed hard against the mouth to muffle the sound, eyes wide with distress. Use rough, distorted line art, anime, intense.",
        "exampleRealistic": "Concept art, raw terror: A person holding their hand tightly over their own screaming mouth, veins standing out in their neck. Focus on the visible pressure."
      },
      {
        "name": "Melipat Diri Sendiri (Contortion)",
        "description": "Karakter melipat tubuh mereka menjadi bentuk yang sangat kompak dan tidak wajar, seringkali di ruang sempit.",
        "exampleAnime": "Body horror anime illustration. A slender figure folded tightly inside a small cabinet or locker, limbs bent at disturbing angles, staring out. Use claustrophobic framing and dark details, anime.",
        "exampleRealistic": "Concept art, extreme flexibility: A contortionist folded into a small box, body bent in an impossible, compact position. Focus on the strain and elasticity of the muscles."
      },
      {
        "name": "The 'Come Closer' (Tangan di Dinding)",
        "description": "Karakter berdiri di ambang pintu, membungkuk ke depan, satu tangan besar diletakkan di dinding di samping kepala mereka.",
        "exampleAnime": "Menacing anime illustration, villain reveal. A tall, shadowy figure leaning forward out of a darkened doorway, one massive hand resting flat against the door frame/wall, inviting the viewer closer. Use deep contrast and an intimidating perspective, anime.",
        "exampleRealistic": "Concept art, imposing figure: A massive silhouette leaning into a room, one hand braced on the door frame, creating a sense of being cornered. Focus on the scale."
      },
      {
        "name": "Bayangan yang Memanjang",
        "description": "Karakter berdiri normal, tetapi bayangannya di dinding atau lantai membentang dan terdistorsi secara tidak wajar.",
        "exampleAnime": "Cinematic horror anime illustration. A character standing calmly, but their shadow on the wall is stretched, disproportionate, and monstrously twisted. Focus on the terrifying distortion of the shadow, anime.",
        "exampleRealistic": "Concept art, surreal horror: A person standing under a low light source, their shadow cast on a textured wall, elongated and menacing with unnatural limbs. Focus on the shadow detail."
      },
      {
        "name": "Menarik Diri (Recoil)",
        "description": "Karakter tiba-tiba terdorong ke belakang oleh teror, satu tangan terangkat untuk melindungi wajah.",
        "exampleAnime": "Sudden shock anime illustration. A character recoiling rapidly, stumbling backward, one arm thrown up instinctively to cover the face or block a sight. Exaggerated motion blur and fear on the face, anime.",
        "exampleRealistic": "Concept art, jump scare moment: A figure suddenly throwing their body backward, eyes squeezed shut, reacting instantly to a loud noise or sudden sight. Focus on the abrupt, panic-driven movement."
      },
      {
        "name": "Tertangkap di Jaring/Tali",
        "description": "Karakter terjerat, anggota tubuhnya direntangkan dan ditarik oleh tali atau jaring.",
        "exampleAnime": "Survival horror anime illustration. A character tangled in thick, glowing vines or spider webs, limbs painfully stretched taut, struggling desperately against the bonds. Use complex line work for the restraints, anime.",
        "exampleRealistic": "Concept art, bondage horror: A figure suspended slightly off the ground, tangled and held fast by thick ropes, posture showing struggle and helplessness. Focus on the texture of the ropes cutting into the skin."
      },
      {
        "name": "The Sinking Head",
        "description": "Karakter duduk atau berdiri, tetapi kepala mereka terlihat seolah-olah 'tenggelam' atau merosot ke dalam bahu dan dada.",
        "exampleAnime": "Quiet horror anime illustration, despair theme. A character sitting with shoulders raised high, head sunken deep into the neck and chest, looking defeated and small. Use dim, heavy overhead lighting, anime.",
        "exampleRealistic": "Concept art, extreme sadness: A person hunched over, their head practically disappearing into the collar of their coat, conveying self-protection and immense emotional weight."
      },
      {
        "name": "The Unblinking Smile",
        "description": "Wajah close-up yang menunjukkan senyum lebar dan 'terlalu sempurna', tetapi matanya tidak mengikuti (tidak tersenyum).",
        "exampleAnime": "Uncanny horror anime portrait. Extreme close-up on a face with a wide, unnatural, forced smile (Cheshire cat grin), but the eyes remain wide, blank, and terrifyingly unblinking. Use smooth, unsettling skin texture, anime, horror style.",
        "exampleRealistic": "Concept art, unsettling android: A figure with an almost perfect, synthetic smile, but their eyes are completely dead and unresponsive. Focus on the disconnect between the mouth and eyes."
      },
      {
        "name": "Mencakar Diri Sendiri",
        "description": "Karakter mencakar atau mencengkeram lengan, leher, atau dada mereka sendiri dengan kuku yang tajam.",
        "exampleAnime": "Body horror anime illustration, mental breakdown. A character frantically raking their own skin with sharp fingernails, eyes wild with pain and paranoia. Use jagged, dynamic lines and high color saturation (for blood), anime.",
        "exampleRealistic": "Concept art, self-harm: A person clutching their own arm so tightly that the skin is being severely pinched, a non-verbal expression of intense psychological pain."
      },
      {
        "name": "Terikat di Kursi",
        "description": "Karakter diikat di kursi, mencoba melonggarkan ikatan, tubuh tegang dan berjuang.",
        "exampleAnime": "Torture/Suspense anime illustration. A character strapped tightly to a wooden chair with ropes, leaning forward and pulling hard against the restraints, face contorted in effort. Use harsh, angular lighting, anime.",
        "exampleRealistic": "Concept art, interrogation: A figure tied to a metal chair, straining every muscle in an attempt to escape. Focus on the visible tension and the texture of the bonds."
      },
      {
        "name": "Lengan Menjangkau dari Kegelapan",
        "description": "Hanya satu lengan yang menjulur panjang dari bayangan, meraih atau menyentuh karakter/penonton.",
        "exampleAnime": "Creepy horror anime illustration. A massive, elongated, pale arm with sharp fingernails extending from an area of pitch darkness, reaching slowly toward the viewer. Focus entirely on the menacing detail of the hand, anime.",
        "exampleRealistic": "Concept art, shadow monster: A single, long, skeletal arm emerging from a patch of deep black shadow, fingers crooked in a grasping gesture. Focus on the contrast and the texture of the skin/bone."
      },
      {
        "name": "Mengambil Posisi Janin (Teror)",
        "description": "Karakter meringkuk di lantai dalam posisi janin, tetapi dengan postur yang kaku dan tegang, bukan santai.",
        "exampleAnime": "Psychological trauma anime illustration. A character curled up tightly into a ball on the floor, hugging their knees, but the body is visibly rigid and shaking with fear. Cold, metallic lighting, anime.",
        "exampleRealistic": "Concept art, intense fear: A figure curled up tightly on a cold tile floor, body trembling, every muscle tense from silent terror. Focus on the defensive, compacted shape."
      },
      {
        "name": "The Upside-Down Hang",
        "description": "Karakter digantung terbalik, biasanya tidak sadarkan diri atau berlumuran darah.",
        "exampleAnime": "Gore horror anime illustration. A figure hanging upside down from a ceiling hook, head dangling, hair falling down, body limp. Use heavy blood splatter effects and dim, industrial lighting, anime, horror style.",
        "exampleRealistic": "Concept art, grim setting: A figure hanging by their ankle, completely inverted and still. Focus on the stark gravity and the long vertical line."
      },
      {
        "name": "Mendorong Kembali Poni",
        "description": "Satu atau kedua tangan dengan gugup menyisir rambut atau poni ke belakang, memperlihatkan dahi dan mata yang ketakutan.",
        "exampleAnime": "Nervous breakdown anime illustration. A character using both hands to violently push back their fringe, revealing wide, manic, terrified eyes and a sweaty forehead. Use harsh overhead light, anime.",
        "exampleRealistic": "Concept art, moment of revelation: A person running a trembling hand through their hair, pushing it back to fully reveal an expression of shock or paranoia. Focus on the sweat and nervous tremor."
      },
      {
        "name": "Tangan di Pipi (Dingin)",
        "description": "Karakter menekan telapak tangan ke pipi atau mata mereka sendiri, ekspresi dingin, bukan karena malu atau terkejut.",
        "exampleAnime": "Villainous anime illustration, cold mood. A character standing, pressing a single, perfectly smooth hand against their own cheek, gazing out with a detached, cold, and calculated expression. Clean, sharp lines and cold blue lighting, anime.",
        "exampleRealistic": "Concept art, emotionless killer: A figure standing motionless, one hand gently pressed to their cheek, observing destruction with an empty, uncaring gaze. Focus on the unsettling calm."
      }
    ]
  },
  {
    "id": "style_8_unik",
    "name": "8. POSE UNIK & NON-KONVENSIONAL",
    "accentColor": "#00CED1",
    "icon": "fas fa-magic",
    "definition": [
      "Pose yang seringkali tidak realistis atau membutuhkan efek khusus/kekuatan super untuk dipertahankan.",
      "Menggabungkan elemen tarian, akrobatik, atau postur aneh (meme-worthy).",
      "Fokus pada kreativitas, humor, atau kemampuan fisik yang mustahil."
    ],
    "subpose": [
      {
        "name": "The Crouching Hero Landing",
        "description": "Karakter mendarat setelah melompat tinggi, satu tangan menyentuh tanah, satu lutut di depan, tubuh condong ke depan.",
        "exampleAnime": "Superhero anime landing illustration, explosion background. A muscular hero crouched low in a dynamic landing pose, one fist slammed into the ground, the other arm stabilizing the body. Smoke and dust swirl around the impact point. Use intense, vibrant colors and extreme perspective, anime, shonen style.",
        "exampleRealistic": "Concept art, comic book landing: A figure in high-tech armor landing heavily on one knee, one fist punching the ground for stability. Focus on the metallic reflection and impact dust."
      },
      {
        "name": "The Plank (Horizontal)",
        "description": "Tubuh dipertahankan lurus sempurna secara horizontal di udara atau bertumpu hanya pada dua titik.",
        "exampleAnime": "Sci-fi anime illustration, anti-gravity effects. A character floating perfectly horizontal, rigid as a board, hands by their sides, moving through space or air effortlessly. Use clean, digital art style and subtle energy lines, anime.",
        "exampleRealistic": "Concept art, parkour challenge: A free-runner performing a flag pole pose, body held perfectly horizontal off a vertical pole. Focus on the extreme core strength."
      },
      {
        "name": "Berdiri di Satu Tangan",
        "description": "Seluruh berat badan diimbangi pada satu tangan, kaki di udara, lurus atau ditekuk.",
        "exampleAnime": "Martial arts anime illustration, dynamic scene. A fighter balanced perfectly on one hand (handstand), the other hand and both legs extended outwards in a fighting kick position. Use sharp line art and a low angle, anime.",
        "exampleRealistic": "Concept art, acrobatic fight: A figure performing a one-handed handstand while delivering a high kick. Focus on the inverted balance and the strain on the supporting arm."
      },
      {
        "name": "The Jojo Pose (Ekstrem)",
        "description": "Pose yang sangat berlebihan, teatrikal, asimetris, dengan sudut tajam, seringkali dengan wajah menghadap ke penonton.",
        "exampleAnime": "Jojo's Bizarre Adventure style anime illustration. A tall, muscular character striking an impossible, heavily stylized pose: back arched, one leg bent and crossing the other, one arm held high in an angular gesture. Use vibrant, unnatural color palettes and unique shading techniques, anime, highly detailed.",
        "exampleRealistic": "Concept art, theatrical style: A figure in a voluminous outfit striking a complicated, multi-angled, impossible pose. Focus on the sharpness of the overall silhouette."
      },
      {
        "name": "The Inverted Cross",
        "description": "Karakter tergantung terbalik dari langit-langit atau palang, tubuh lurus dan kaku.",
        "exampleAnime": "Gymnastics anime illustration, intense training. A strong character hanging upside down from a bar, holding their body straight and rigid in a perfect inverted cross shape. Use intense muscle definition and strong backlighting, anime.",
        "exampleRealistic": "Concept art, circus acrobat: A figure hanging by their feet, holding their body in a taut, rigid line, arms stretched wide. Focus on the raw gravity effect."
      },
      {
        "name": "Senjata di Bahu (Ringan)",
        "description": "Senjata besar (misalnya kapak, bazoka) disandarkan dengan santai di bahu, menunjukkan kekuatan tanpa usaha.",
        "exampleAnime": "Heavy weapons anime illustration, relaxed stance. A young, petite character standing casually with a ridiculously oversized rocket launcher resting lightly on one shoulder, smiling gently. Humorously disproportionate scale, anime.",
        "exampleRealistic": "Concept art, sci-fi mercenary: A mercenary in full gear resting a massive, futuristic weapon easily on their shoulder. Focus on the contrast between the weapon's size and the casual hold."
      },
      {
        "name": "The Fourth Wall Break (Menunjuk)",
        "description": "Karakter menunjuk langsung ke 'kamera' atau penonton dengan mata berkedip atau ekspresi main-main.",
        "exampleAnime": "Meme-worthy anime illustration. A character winking and pointing a finger directly out of the frame at the viewer, engaging directly with the audience. Use bright, comic book style effects, anime.",
        "exampleRealistic": "Concept art, breaking convention: A figure stepping out of a painting frame, pointing a conspiratorial finger directly at the viewer. Focus on the surreal element."
      },
      {
        "name": "Duduk Menggantung Kaki",
        "description": "Duduk di tepi tebing atau atap, kaki menjuntai bebas di udara, menunjukkan ketenangan di ketinggian.",
        "exampleAnime": "Aesthetic anime illustration, city night. A character sitting calmly on the edge of a very high skyscraper, legs dangling over the side, looking at the city lights. Peaceful, melancholic mood, anime.",
        "exampleRealistic": "Concept art, urban exploration: A figure sitting on the edge of a high bridge, legs hanging down over the water, relaxed and fearless. Focus on the texture of the stone and the long drop."
      },
      {
        "name": "The Head-Down Bow",
        "description": "Karakter membungkuk sangat rendah dari pinggang, menyembunyikan wajah di bawah rambut atau lengan yang menjuntai.",
        "exampleAnime": "Mystery anime illustration. A character standing with a deep, unsettling bow, head hanging almost to their knees, their face completely obscured by hair. Use intense shadow to hide their identity, anime.",
        "exampleRealistic": "Concept art, silent threat: A figure bowing in an extreme, unnatural posture, head hanging low, suggesting humility or hidden menace. Focus on the line of the hunched back."
      },
      {
        "name": "Melompat Kegirangan (Stomping)",
        "description": "Karakter melompat ke udara dengan satu kaki ditarik ke belakang, seolah-olah akan 'menginjak' sesuatu.",
        "exampleAnime": "Comedic shonen anime illustration. A character launching into the air in a moment of extreme, exaggerated excitement or rage, one foot raised high, ready to stomp. Use funny, dynamic motion lines, anime.",
        "exampleRealistic": "Concept art, childish joy: An adult figure jumping up and down in a moment of pure, unbridled excitement, performing a heavy foot stomp. Focus on the energetic movement."
      },
      {
        "name": "The Crouching Snarl",
        "description": "Karakter berjongkok dengan punggung melengkung, gigi menyeringai, terlihat seperti binatang buas.",
        "exampleAnime": "Beast transformation anime illustration. A character hunched in a low, predatory crouch, face contorted in a snarl, revealing sharp fangs. Use dark, angular lines and animalistic posture, anime.",
        "exampleRealistic": "Concept art, werewolf transformation: A figure dropping into a low, bestial crouch, hands morphing into claws, eyes glowing with primal rage. Focus on the raw, animalistic tension."
      },
      {
        "name": "Membawa Banyak Barang (Keseimbangan)",
        "description": "Karakter membawa tumpukan barang yang tidak stabil, menggunakan dagu, kepala, dan bahu untuk menyeimbangkan.",
        "exampleAnime": "Comedic slice of life anime illustration. A character struggling to carry a towering, impossible stack of books, bags, and groceries, balancing precariously. Exaggerated expression of strain, anime.",
        "exampleRealistic": "Concept art, extreme shopping: A person leaving a store, arms full of bags, using their chin to balance one last item on the top of the pile. Focus on the awkward balancing act."
      },
      {
        "name": "The Matrix Lean (Waktu Lambat)",
        "description": "Karakter condong ke belakang sejauh mungkin, menghindari sesuatu, tubuh kaku di tengah udara.",
        "exampleAnime": "Bullet-time anime illustration. A character frozen mid-air, leaning backward at a near-horizontal angle to avoid a laser blast or bullet. Hair and clothes float naturally, anime, sci-fi action.",
        "exampleRealistic": "Concept art, cinematic action: A figure suspended mid-dive, leaning back dramatically to avoid an unseen projectile. Focus on the smooth, impossible curve of the body."
      },
      {
        "name": "Menggigit Jari/Bibir",
        "description": "Close-up tangan atau wajah di mana karakter menggigit bibir bawah atau jari mereka dengan cemas.",
        "exampleAnime": "Shoujo anime illustration, close-up on mouth. A character biting their bottom lip hard, eyes looking down in worry or frustration. Focus on the detail of the lips and teeth, anime.",
        "exampleRealistic": "Concept art, intense anxiety: A close-up on a person's mouth and hand, where they are nervously chewing on a fingernail or the lower lip. Focus on the subtle tremor."
      },
      {
        "name": "Memegang Dahi (Kelebihan Beban)",
        "description": "Karakter menekan telapak tangan ke dahi mereka, wajahnya tertutup sebagian, menunjukkan stres mental yang luar biasa.",
        "exampleAnime": "Psychological anime illustration, high pressure. A student or detective sitting, pressing a hand hard against their forehead, eyes closed, overwhelmed by information. Use geometric line art to show mental strain, anime.",
        "exampleRealistic": "Concept art, mental block: A person sitting at a large desk, leaning forward, one hand aggressively shielding their eyes and pressing into their forehead. Focus on the raw frustration."
      },
      {
        "name": "The Unnatural Squat",
        "description": "Berjongkok dengan posisi yang sangat rendah, satu lutut menyentuh tanah, dan tumit kaki lainnya terangkat tinggi.",
        "exampleAnime": "Avant-garde fashion anime illustration. A model in an unusually low squat, balancing on the ball of one foot and the knee of the other, head held high and aloof. Use sharp lighting and complex shadow work, anime.",
        "exampleRealistic": "Concept art, awkward stance: A figure crouched low, resting only on the toe of one foot and the kneecap of the other. Focus on the instability of the pose."
      },
      {
        "name": "Berjalan Melalui Hujan (Slumped)",
        "description": "Berjalan dengan bahu dan kepala membungkuk, tangan menutupi kepala dari hujan (tanpa payung).",
        "exampleAnime": "Melancholic anime illustration, heavy rain. A character walking slowly under a downpour, head bent low, using their arm to shield their face from the rain. Wet clothes sticking to the body, anime.",
        "exampleRealistic": "Concept art, desolate mood: A figure walking slowly down a deserted street in heavy rain, shoulders hunched, using a hand to cover their eyes. Focus on the reflection on the wet surface."
      },
      {
        "name": "Menarik Topi/Tudung",
        "description": "Karakter menarik topi atau tudung mereka ke bawah untuk menyembunyikan mata, meninggalkan wajah dalam bayangan.",
        "exampleAnime": "Mysterious action anime illustration. A rogue character standing in a dark alley, one hand pulling the brim of their fedora or hood down, eyes invisible in the shadow. Strong dramatic lighting, anime.",
        "exampleRealistic": "Concept art, concealed identity: A figure wearing a deep hood, pulling the front down with both hands to ensure the face is entirely obscured by darkness. Focus on the silhouette."
      },
      {
        "name": "The Over-the-Top Bow (Menantang)",
        "description": "Membungkuk berlebihan (seperti pelayan) tetapi dengan senyum yang mengancam atau mata yang menantang.",
        "exampleAnime": "Villainous anime illustration, grand gesture. A tall villain performing a low, sweeping bow with one arm extended, but their head is turned to the viewer, smiling cruelly. Use theatrical lighting and grand attire, anime.",
        "exampleRealistic": "Concept art, sarcastic respect: A figure bowing with an elaborate flourish, but their eyes are narrowed in contempt. Focus on the conflict between posture and expression."
      },
      {
        "name": "Kaki Melingkari (The Leg Wrap)",
        "description": "Karakter berdiri dengan satu kaki melingkari kaki yang lain sepenuhnya, menyilangkan betis dan pergelangan kaki.",
        "exampleAnime": "Fashionable anime illustration, unique stance. A character standing with their legs tightly wrapped around each other, creating a unique, intertwined silhouette. Head tilted, intense expression, anime.",
        "exampleRealistic": "Concept art, stylized movement: A model standing with their legs tightly crossed and wrapped, resting their weight on the outer foot. Focus on the intricate line of the legs."
      },
      {
        "name": "Menghilang ke Dalam Bayangan",
        "description": "Karakter condong ke belakang atau ke samping, berbaur dengan bayangan, hanya menyisakan siluet yang memudar.",
        "exampleAnime": "Stealth anime illustration. A shadowy assassin figure leaning back into a corner, their body dissolving into the black background, only a faint outline remaining. Use deep black/purple colors and subtle texture, anime.",
        "exampleRealistic": "Concept art, invisibility: A figure pressing against a dark wall, becoming one with the shadow, their form barely discernible. Focus on the edge where light meets dark."
      },
      {
        "name": "The Hands-Up Shrug",
        "description": "Lengan diangkat ke atas, telapak tangan terbuka, disertai dengan mengangkat bahu yang berlebihan (tanda 'entahlah' atau ketidakberdayaan).",
        "exampleAnime": "Comedic anime illustration, highly expressive. A character standing with both shoulders raised to their ears and arms thrown up, palms open, looking helpless and confused. Exaggerated motion and expression, anime.",
        "exampleRealistic": "Concept art, theatrical gesture: A figure standing with a deep shrug, arms extended in a clear gesture of 'I don't know' or futility. Focus on the roundness of the shoulders."
      },
      {
        "name": "The Backward Walk",
        "description": "Karakter berjalan mundur perlahan, mempertahankan kontak mata yang tegang dengan penonton/musuh.",
        "exampleAnime": "Suspenseful anime illustration. A character walking slowly backward away from the viewer, eyes locked on the camera with intense fear or caution. Use slightly shaky camera effect (implied), anime.",
        "exampleRealistic": "Concept art, slow retreat: A figure slowly backing away through a dark tunnel, maintaining unwavering eye contact with a threat. Focus on the unnatural slowness of the movement."
      },
      {
        "name": "Memegang Wajah dengan Kaki",
        "description": "Pose ekstrem di mana karakter memegang wajah mereka sendiri dengan salah satu kaki yang terangkat tinggi.",
        "exampleAnime": "Contortion anime illustration, impossible flexibility. A highly flexible character sitting or lying down, one leg bent and extended so that the foot is resting against their own face/head. Focus on the extreme lines and tension, anime.",
        "exampleRealistic": "Concept art, impossible flexibility: A figure performing an extreme yoga or contortion pose, using their foot to touch their cheek. Focus on the incredible range of motion."
      },
      {
        "name": "The Maniacal Point",
        "description": "Karakter menunjuk ke suatu objek atau arah dengan senyum gila, seolah-olah mengungkapkan rahasia menakutkan.",
        "exampleAnime": "Villain reveal anime illustration. A character standing, pointing dramatically with a rigid finger toward a dark corner, their face lit by a sudden, manic smile. Use harsh, directional lighting, anime.",
        "exampleRealistic": "Concept art, unsettling guide: A figure standing on a pedestal, pointing an accusatory or crazy finger toward an unseen object. Focus on the intensity of the point."
      }
    ]
  }
]

